sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
/**
  ******************************************************************************
  * @file    stm32wb05n_events.c
  * @author  AMS - RF Application team
  * @version V1.4.0
  * @date    26 July 2024
  * @brief   Source file for external uC - STM32WB05N in network coprocessor mode
  *          (Event callbacks). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include <stdint.h>
#include "stm32wb05n_events.h"
#include "stm32wb_conf.h"

tBleStatus hci_disconnection_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_encryption_change_event_process(uint8_t *buffer_in);
tBleStatus hci_read_remote_version_information_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_hardware_error_event_process(uint8_t *buffer_in);
tBleStatus hci_number_of_completed_packets_event_process(uint8_t *buffer_in);
tBleStatus hci_data_buffer_overflow_event_process(uint8_t *buffer_in);
tBleStatus hci_encryption_key_refresh_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_authenticated_payload_timeout_expired_event_process(uint8_t *buffer_in);
tBleStatus aci_blue_initialized_event_process(uint8_t *buffer_in);
tBleStatus aci_blue_crash_info_event_process(uint8_t *buffer_in);
tBleStatus aci_hal_end_of_radio_activity_event_process(uint8_t *buffer_in);
tBleStatus aci_hal_fw_error_event_process(uint8_t *buffer_in);
tBleStatus aci_hal_le_test_end_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_limited_discoverable_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_pairing_complete_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_passkey_req_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_proc_complete_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_addr_not_resolved_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_numeric_comparison_value_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_keypress_notification_event_process(uint8_t *buffer_in);
tBleStatus aci_gap_pairing_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_connection_update_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_proc_timeout_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_connection_update_req_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_disconnection_complete_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_flow_control_credit_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_sdu_data_tx_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_sdu_data_rx_nwk_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_reconfiguration_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_command_reject_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_connection_req_event_process(uint8_t *buffer_in);
tBleStatus aci_l2cap_cos_connection_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_srv_attribute_modified_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_proc_timeout_event_process(uint8_t *buffer_in);
tBleStatus aci_att_exchange_mtu_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_find_info_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_find_by_type_value_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_by_type_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_blob_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_multiple_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_by_group_type_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_prepare_write_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_exec_write_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_clt_indication_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_clt_notification_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_clt_proc_complete_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_clt_error_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_clt_disc_read_char_by_uuid_resp_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_tx_pool_available_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_srv_confirmation_event_process(uint8_t *buffer_in);
tBleStatus aci_att_srv_exec_write_req_event_process(uint8_t *buffer_in);
tBleStatus aci_gatt_srv_authorize_nwk_event_process(uint8_t *buffer_in);
tBleStatus aci_att_clt_read_multiple_var_len_resp_event_process(uint8_t *buffer_in);
tBleStatus hci_le_connection_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_advertising_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_connection_update_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_read_remote_features_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_long_term_key_request_event_process(uint8_t *buffer_in);
tBleStatus hci_le_data_length_change_event_process(uint8_t *buffer_in);
tBleStatus hci_le_read_local_p256_public_key_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_generate_dhkey_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_enhanced_connection_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_directed_advertising_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_phy_update_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_extended_advertising_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_sync_established_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_sync_lost_event_process(uint8_t *buffer_in);
tBleStatus hci_le_scan_timeout_event_process(uint8_t *buffer_in);
tBleStatus hci_le_advertising_set_terminated_event_process(uint8_t *buffer_in);
tBleStatus hci_le_scan_request_received_event_process(uint8_t *buffer_in);
tBleStatus hci_le_channel_selection_algorithm_event_process(uint8_t *buffer_in);
tBleStatus hci_le_connectionless_iq_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_connection_iq_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_cte_request_failed_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_sync_transfer_received_event_process(uint8_t *buffer_in);
tBleStatus hci_le_cis_established_event_process(uint8_t *buffer_in);
tBleStatus hci_le_cis_request_event_process(uint8_t *buffer_in);
tBleStatus hci_le_create_big_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_terminate_big_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_big_sync_established_event_process(uint8_t *buffer_in);
tBleStatus hci_le_big_sync_lost_event_process(uint8_t *buffer_in);
tBleStatus hci_le_request_peer_sca_complete_event_process(uint8_t *buffer_in);
tBleStatus hci_le_path_loss_threshold_event_process(uint8_t *buffer_in);
tBleStatus hci_le_transmit_power_reporting_event_process(uint8_t *buffer_in);
tBleStatus hci_le_biginfo_advertising_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_subrate_change_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_sync_established_v2_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_report_v2_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_sync_transfer_received_v2_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_subevent_data_request_event_process(uint8_t *buffer_in);
tBleStatus hci_le_periodic_advertising_response_report_event_process(uint8_t *buffer_in);
tBleStatus hci_le_enhanced_connection_complete_v2_event_process(uint8_t *buffer_in);
const hci_events_table_type hci_events_table[8] = {
  /* hci_disconnection_complete_event */
  {0x0005, hci_disconnection_complete_event_process},
  /* hci_encryption_change_event */
  {0x0008, hci_encryption_change_event_process},
  /* hci_read_remote_version_information_complete_event */
  {0x000c, hci_read_remote_version_information_complete_event_process},
  /* hci_hardware_error_event */
  {0x0010, hci_hardware_error_event_process},
  /* hci_number_of_completed_packets_event */
  {0x0013, hci_number_of_completed_packets_event_process},
  /* hci_data_buffer_overflow_event */
  {0x001a, hci_data_buffer_overflow_event_process},
  /* hci_encryption_key_refresh_complete_event */
  {0x0030, hci_encryption_key_refresh_complete_event_process},
  /* hci_authenticated_payload_timeout_expired_event */
  {0x0057, hci_authenticated_payload_timeout_expired_event_process},
};
const hci_le_meta_events_table_type hci_le_meta_events_table[40] = {
  /* hci_le_connection_complete_event */
  {0x0001, hci_le_connection_complete_event_process},
  /* hci_le_advertising_report_event */
  {0x0002, hci_le_advertising_report_event_process},
  /* hci_le_connection_update_complete_event */
  {0x0003, hci_le_connection_update_complete_event_process},
  /* hci_le_read_remote_features_complete_event */
  {0x0004, hci_le_read_remote_features_complete_event_process},
  /* hci_le_long_term_key_request_event */
  {0x0005, hci_le_long_term_key_request_event_process},
  /* hci_le_data_length_change_event */
  {0x0007, hci_le_data_length_change_event_process},
  /* hci_le_read_local_p256_public_key_complete_event */
  {0x0008, hci_le_read_local_p256_public_key_complete_event_process},
  /* hci_le_generate_dhkey_complete_event */
  {0x0009, hci_le_generate_dhkey_complete_event_process},
  /* hci_le_enhanced_connection_complete_event */
  {0x000a, hci_le_enhanced_connection_complete_event_process},
  /* hci_le_directed_advertising_report_event */
  {0x000b, hci_le_directed_advertising_report_event_process},
  /* hci_le_phy_update_complete_event */
  {0x000c, hci_le_phy_update_complete_event_process},
  /* hci_le_extended_advertising_report_event */
  {0x000d, hci_le_extended_advertising_report_event_process},
  /* hci_le_periodic_advertising_sync_established_event */
  {0x000e, hci_le_periodic_advertising_sync_established_event_process},
  /* hci_le_periodic_advertising_report_event */
  {0x000f, hci_le_periodic_advertising_report_event_process},
  /* hci_le_periodic_advertising_sync_lost_event */
  {0x0010, hci_le_periodic_advertising_sync_lost_event_process},
  /* hci_le_scan_timeout_event */
  {0x0011, hci_le_scan_timeout_event_process},
  /* hci_le_advertising_set_terminated_event */
  {0x0012, hci_le_advertising_set_terminated_event_process},
  /* hci_le_scan_request_received_event */
  {0x0013, hci_le_scan_request_received_event_process},
  /* hci_le_channel_selection_algorithm_event */
  {0x0014, hci_le_channel_selection_algorithm_event_process},
  /* hci_le_connectionless_iq_report_event */
  {0x0015, hci_le_connectionless_iq_report_event_process},
  /* hci_le_connection_iq_report_event */
  {0x0016, hci_le_connection_iq_report_event_process},
  /* hci_le_cte_request_failed_event */
  {0x0017, hci_le_cte_request_failed_event_process},
  /* hci_le_periodic_advertising_sync_transfer_received_event */
  {0x0018, hci_le_periodic_advertising_sync_transfer_received_event_process},
  /* hci_le_cis_established_event */
  {0x0019, hci_le_cis_established_event_process},
  /* hci_le_cis_request_event */
  {0x001a, hci_le_cis_request_event_process},
  /* hci_le_create_big_complete_event */
  {0x001b, hci_le_create_big_complete_event_process},
  /* hci_le_terminate_big_complete_event */
  {0x001c, hci_le_terminate_big_complete_event_process},
  /* hci_le_big_sync_established_event */
  {0x001d, hci_le_big_sync_established_event_process},
  /* hci_le_big_sync_lost_event */
  {0x001e, hci_le_big_sync_lost_event_process},
  /* hci_le_request_peer_sca_complete_event */
  {0x001f, hci_le_request_peer_sca_complete_event_process},
  /* hci_le_path_loss_threshold_event */
  {0x0020, hci_le_path_loss_threshold_event_process},
  /* hci_le_transmit_power_reporting_event */
  {0x0021, hci_le_transmit_power_reporting_event_process},
  /* hci_le_biginfo_advertising_report_event */
  {0x0022, hci_le_biginfo_advertising_report_event_process},
  /* hci_le_subrate_change_event */
  {0x0023, hci_le_subrate_change_event_process},
  /* hci_le_periodic_advertising_sync_established_v2_event */
  {0x0024, hci_le_periodic_advertising_sync_established_v2_event_process},
  /* hci_le_periodic_advertising_report_v2_event */
  {0x0025, hci_le_periodic_advertising_report_v2_event_process},
  /* hci_le_periodic_advertising_sync_transfer_received_v2_event */
  {0x0026, hci_le_periodic_advertising_sync_transfer_received_v2_event_process},
  /* hci_le_periodic_advertising_subevent_data_request_event */
  {0x0027, hci_le_periodic_advertising_subevent_data_request_event_process},
  /* hci_le_periodic_advertising_response_report_event */
  {0x0028, hci_le_periodic_advertising_response_report_event_process},
  /* hci_le_enhanced_connection_complete_v2_event */
  {0x0029, hci_le_enhanced_connection_complete_v2_event_process},
};
const hci_vendor_specific_events_table_type hci_vendor_specific_events_table[46] = {
  /* aci_blue_initialized_event */
  {0x0001, aci_blue_initialized_event_process},
  /* aci_blue_crash_info_event */
  {0x0003, aci_blue_crash_info_event_process},
  /* aci_hal_end_of_radio_activity_event */
  {0x0004, aci_hal_end_of_radio_activity_event_process},
  /* aci_hal_fw_error_event */
  {0x0006, aci_hal_fw_error_event_process},
  /* aci_hal_le_test_end_event */
  {0x0007, aci_hal_le_test_end_event_process},
  /* aci_gap_limited_discoverable_event */
  {0x0400, aci_gap_limited_discoverable_event_process},
  /* aci_gap_pairing_complete_event */
  {0x0401, aci_gap_pairing_complete_event_process},
  /* aci_gap_passkey_req_event */
  {0x0402, aci_gap_passkey_req_event_process},
  /* aci_gap_proc_complete_event */
  {0x0407, aci_gap_proc_complete_event_process},
  /* aci_gap_addr_not_resolved_event */
  {0x0408, aci_gap_addr_not_resolved_event_process},
  /* aci_gap_numeric_comparison_value_event */
  {0x0409, aci_gap_numeric_comparison_value_event_process},
  /* aci_gap_keypress_notification_event */
  {0x040a, aci_gap_keypress_notification_event_process},
  /* aci_gap_pairing_event */
  {0x040b, aci_gap_pairing_event_process},
  /* aci_l2cap_connection_update_resp_event */
  {0x0800, aci_l2cap_connection_update_resp_event_process},
  /* aci_l2cap_proc_timeout_event */
  {0x0801, aci_l2cap_proc_timeout_event_process},
  /* aci_l2cap_connection_update_req_event */
  {0x0802, aci_l2cap_connection_update_req_event_process},
  /* aci_l2cap_cos_disconnection_complete_event */
  {0x0804, aci_l2cap_cos_disconnection_complete_event_process},
  /* aci_l2cap_cos_flow_control_credit_event */
  {0x0805, aci_l2cap_cos_flow_control_credit_event_process},
  /* aci_l2cap_cos_sdu_data_tx_event */
  {0x0806, aci_l2cap_cos_sdu_data_tx_event_process},
  /* aci_l2cap_cos_sdu_data_rx_nwk_event */
  {0x0807, aci_l2cap_cos_sdu_data_rx_nwk_event_process},
  /* aci_l2cap_cos_reconfiguration_event */
  {0x0809, aci_l2cap_cos_reconfiguration_event_process},
  /* aci_l2cap_command_reject_event */
  {0x080a, aci_l2cap_command_reject_event_process},
  /* aci_l2cap_cos_connection_req_event */
  {0x080e, aci_l2cap_cos_connection_req_event_process},
  /* aci_l2cap_cos_connection_resp_event */
  {0x080f, aci_l2cap_cos_connection_resp_event_process},
  /* aci_gatt_srv_attribute_modified_event */
  {0x0c01, aci_gatt_srv_attribute_modified_event_process},
  /* aci_gatt_proc_timeout_event */
  {0x0c02, aci_gatt_proc_timeout_event_process},
  /* aci_att_exchange_mtu_resp_event */
  {0x0c03, aci_att_exchange_mtu_resp_event_process},
  /* aci_att_clt_find_info_resp_event */
  {0x0c04, aci_att_clt_find_info_resp_event_process},
  /* aci_att_clt_find_by_type_value_resp_event */
  {0x0c05, aci_att_clt_find_by_type_value_resp_event_process},
  /* aci_att_clt_read_by_type_resp_event */
  {0x0c06, aci_att_clt_read_by_type_resp_event_process},
  /* aci_att_clt_read_resp_event */
  {0x0c07, aci_att_clt_read_resp_event_process},
  /* aci_att_clt_read_blob_resp_event */
  {0x0c08, aci_att_clt_read_blob_resp_event_process},
  /* aci_att_clt_read_multiple_resp_event */
  {0x0c09, aci_att_clt_read_multiple_resp_event_process},
  /* aci_att_clt_read_by_group_type_resp_event */
  {0x0c0a, aci_att_clt_read_by_group_type_resp_event_process},
  /* aci_att_clt_prepare_write_resp_event */
  {0x0c0c, aci_att_clt_prepare_write_resp_event_process},
  /* aci_att_clt_exec_write_resp_event */
  {0x0c0d, aci_att_clt_exec_write_resp_event_process},
  /* aci_gatt_clt_indication_event */
  {0x0c0e, aci_gatt_clt_indication_event_process},
  /* aci_gatt_clt_notification_event */
  {0x0c0f, aci_gatt_clt_notification_event_process},
  /* aci_gatt_clt_proc_complete_event */
  {0x0c10, aci_gatt_clt_proc_complete_event_process},
  /* aci_gatt_clt_error_resp_event */
  {0x0c11, aci_gatt_clt_error_resp_event_process},
  /* aci_gatt_clt_disc_read_char_by_uuid_resp_event */
  {0x0c12, aci_gatt_clt_disc_read_char_by_uuid_resp_event_process},
  /* aci_gatt_tx_pool_available_event */
  {0x0c16, aci_gatt_tx_pool_available_event_process},
  /* aci_gatt_srv_confirmation_event */
  {0x0c17, aci_gatt_srv_confirmation_event_process},
  /* aci_att_srv_exec_write_req_event */
  {0x0c1c, aci_att_srv_exec_write_req_event_process},
  /* aci_gatt_srv_authorize_nwk_event */
  {0x0c1d, aci_gatt_srv_authorize_nwk_event_process},
  /* aci_att_clt_read_multiple_var_len_resp_event */
  {0x0c1e, aci_att_clt_read_multiple_var_len_resp_event_process},
};
/* hci_disconnection_complete_event */
/* Event len: 1 + 2 + 1 */
/**
 * @brief The Disconnection Complete event occurs when a connection is
 *        terminated. The status parameter indicates if the disconnection was
 *        successful or not. The reason parameter indicates the reason for the
 *        disconnection if the disconnection was successful. If the
 *        disconnection was not successful, the value of the reason parameter
 *        can be ignored by the Host. For example, this can be the case if the
 *        Host has issued the Disconnect command and there was a parameter
 *        error, or the command was not presently allowed, or a
 *        Connection_Handle that didn't correspond to a connection was given.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection_Handle which was disconnected.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Reason Reason for disconnection. See Error Codes.
 * @retval None
 */

