sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
tBleStatus aci_hal_le_test_end_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_hal_le_test_end_event_rp0 *rp0 = (aci_hal_le_test_end_event_rp0 *)buffer_in;
  aci_hal_le_test_end_event(rp0->Number_Of_Packets);

  return status;
}
/* aci_gap_limited_discoverable_event */
/* Event len: 0 */
/**
 * @brief This event is generated by the controller when the limited
 *        discoverable mode ends due to timeout. The timeout is 180 seconds.
 * @retval None
 */

tBleStatus aci_gap_limited_discoverable_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  aci_gap_limited_discoverable_event();

  return status;
}
/* aci_gap_pairing_complete_event */
/* Event len: 2 + 1 + 1 */
/**
 * @brief This event is generated when the pairing process has completed
 *        successfully or a pairing procedure timeout has occurred or the
 *        pairing has failed. This is to notify the application that we have
 *        paired with a remote device so that it can take further actions or to
 *        notify that a timeout has occurred so that the upper layer can decide
 *        to disconnect the link.
 * @param Connection_Handle Connection handle on which the pairing procedure
 *        completed
 * @param Status Pairing status. If 0x02, see Reason code.
 *        Values:
 *        - 0x00: Success
 *        - 0x01: Timeout
 *        - 0x02: Pairing Failed
 *        - 0x03: Encryption failed, LTK missing on local device
 *        - 0x04: Encryption failed, LTK missing on peer device
 *        - 0x05: Encryption not supported by remote device
 * @param Reason Pairing reason error code
 *        Values:
 *        - 0x00
 *        - 0x01: SM_PASSKEY_ENTRY_FAILED
 *        - 0x02: SM_OOB_NOT_AVAILABLE
 *        - 0x03: SM_AUTHENTICATION_REQUIREMENTS
 *        - 0x04: SM_CONFIRM_VALUE_FAILED
 *        - 0x05: SM_PAIRING_NOT_SUPPORTED
 *        - 0x06: SM_ENCRYPTION_KEY_SIZE
 *        - 0x07: SM_CMD_NOT_SUPPORTED
 *        - 0x08: SM_UNSPECIFIED_REASON
 *        - 0x09: SM_REPEATED_ATTEMPTS
 *        - 0x0A: SM_INVALID_PARAMETERS
 *        - 0x0B: SMP_DHKEY_CHECK_FAILED
 *        - 0x0C: SMP_NUMCOMPARISON_FAILED
 *        - 0x0D: SM_BR_EDR_PAIRING_IN_PROGRESS
 *        - 0x0E: SM_CROSS_TRANSPORT_KEY_NOT_ALLOWED
 *        - 0x0F: SM_KEY_REJECTED
 * @retval None
 */

tBleStatus aci_gap_pairing_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_pairing_complete_event_rp0 *rp0 = (aci_gap_pairing_complete_event_rp0 *)buffer_in;
  aci_gap_pairing_complete_event(rp0->Connection_Handle,
                                 rp0->Status,
                                 rp0->Reason);

  return status;
}
/* aci_gap_passkey_req_event */
/* Event len: 2 + 1 */
/**
 * @brief This event is generated by the Security manager to the application
 *        when a passkey is required for pairing. When this event is received,
 *        the application has to respond with the @ref aci_gap_passkey_resp
 *        command.
 * @param Connection_Handle Connection handle for which the passkey has been
 *        requested.
 * @param Display_Input This parameter informs the application if the passkey
 *        needs to be displayed or requested for input on the local device.
 *        Values:
 *        - 0x00: PASSKEY_DISPLAY
 *        - 0x01: PASSKEY_INPUT
 * @retval None
 */

tBleStatus aci_gap_passkey_req_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_passkey_req_event_rp0 *rp0 = (aci_gap_passkey_req_event_rp0 *)buffer_in;
  aci_gap_passkey_req_event(rp0->Connection_Handle,
                            rp0->Display_Input);

  return status;
}
/* aci_gap_proc_complete_event */
/* Event len: 1 + 1 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is sent by the GAP to the upper layers when a procedure
 *        previously started has been terminated by the upper layer or has
 *        completed for any other reason
 * @param Procedure_Code Code identifying the procedure.
 *        Values:
 *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
 *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
 *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x05: GAP_OBSERVATION_PROC
 *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x07: GAP_NAME_DISCOVERY_PROC
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Data_Length Length of Data in octets
 * @param Data Procedure Specific Data: - For Name Discovery Procedure: the name
 *        of the peer device if the procedure completed successfully.
 * @retval None
 */

tBleStatus aci_gap_proc_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_proc_complete_event_rp0 *rp0 = (aci_gap_proc_complete_event_rp0 *)buffer_in;
  aci_gap_proc_complete_event(rp0->Procedure_Code,
                              rp0->Status,
                              rp0->Data_Length,
                              rp0->Data);

  return status;
}
/* aci_gap_addr_not_resolved_event */
/* Event len: 2 */
/**
 * @brief This event is sent only by a privacy enabled Peripheral. The event is
 *        sent to the upper layers when the peripheral is unsuccessful in
 *        resolving the resolvable address of the peer device after connecting
 *        to it.
 * @param Connection_Handle Connection handle for which the private address
 *        could not be resolved with any of the stored IRK's.
 * @retval None
 */

tBleStatus aci_gap_addr_not_resolved_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_addr_not_resolved_event_rp0 *rp0 = (aci_gap_addr_not_resolved_event_rp0 *)buffer_in;
  aci_gap_addr_not_resolved_event(rp0->Connection_Handle);

