sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
tBleStatus aci_l2cap_connection_update_req_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_connection_update_req_event_rp0 *rp0 = (aci_l2cap_connection_update_req_event_rp0 *)buffer_in;
  aci_l2cap_connection_update_req_event(rp0->Connection_Handle,
                                        rp0->Identifier,
                                        rp0->L2CAP_Length,
                                        rp0->Connection_Interval_Min,
                                        rp0->Connection_Interval_Max,
                                        rp0->Max_Latency,
                                        rp0->Timeout_Multiplier);

  return status;
}
/* aci_l2cap_cos_disconnection_complete_event */
/* Event len: 2 + 2 */
/**
 * @brief Event raised when an L2CAP channel using LE Credit Based Flow Control
 *        mode is terminated.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @retval None
 */

tBleStatus aci_l2cap_cos_disconnection_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_disconnection_complete_event_rp0 *rp0 = (aci_l2cap_cos_disconnection_complete_event_rp0 *)buffer_in;
  aci_l2cap_cos_disconnection_complete_event(rp0->Connection_Handle,
                                             rp0->CID);

  return status;
}
/* aci_l2cap_cos_flow_control_credit_event */
/* Event len: 2 + 2 + 2 + 2 */
/**
 * @brief Event raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from
 *        the peer, which means that it is capable of receiving additional
 *        K-frames (for example after it has processed one or more K-frames) in
 *        LE Credit Based Flow Control.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param TX_Credits The number of additional k-frames that the peer's L2CAP
 *        layer entity can receive.
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 *        Values:
 *        - 1 ... 65535
 * @retval None
 */

tBleStatus aci_l2cap_cos_flow_control_credit_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_flow_control_credit_event_rp0 *rp0 = (aci_l2cap_cos_flow_control_credit_event_rp0 *)buffer_in;
  aci_l2cap_cos_flow_control_credit_event(rp0->Connection_Handle,
                                          rp0->CID,
                                          rp0->TX_Credits,
                                          rp0->TX_Credit_Balance);

  return status;
}
/* aci_l2cap_cos_sdu_data_tx_event */
/* Event len: 2 + 2 + 2 + 2 */
/**
 * @brief Event raised when an SDU to be transmitted has been processed by the
 *        local L2CAP layer entity.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param SDU_Length
 * @param TX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently send to the peer.
 * @retval None
 */

tBleStatus aci_l2cap_cos_sdu_data_tx_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_sdu_data_tx_event_rp0 *rp0 = (aci_l2cap_cos_sdu_data_tx_event_rp0 *)buffer_in;
  aci_l2cap_cos_sdu_data_tx_event(rp0->Connection_Handle,
                                  rp0->CID,
                                  rp0->SDU_Length,
                                  rp0->TX_Credit_Balance);

  return status;
}
/* aci_l2cap_cos_sdu_data_rx_nwk_event */
/* Event len: 2 + 2 + 2 + 2 + rp0->SDU_Length * (sizeof(uint8_t)) */
/**
 * @brief Event raised when an SDU has been received.
 * @param Connection_Handle Handle identifying the connection.
 * @param CID The local channel endpoint that identifies the L2CAP channel.
 * @param RX_Credit_Balance Remaining number of K-frames that local L2CAP layer
 *        entity can currently receive from the peer. If automatic management of
 *        credits is enabled, this number is automatically changed after the SDU
 *        is extracted.
 * @param SDU_Length
 * @param SDU_Data
 * @retval None
 */

tBleStatus aci_l2cap_cos_sdu_data_rx_nwk_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_sdu_data_rx_nwk_event_rp0 *rp0 = (aci_l2cap_cos_sdu_data_rx_nwk_event_rp0 *)buffer_in;
  aci_l2cap_cos_sdu_data_rx_nwk_event(rp0->Connection_Handle,
                                      rp0->CID,
                                      rp0->RX_Credit_Balance,
                                      rp0->SDU_Length,
                                      rp0->SDU_Data);

  return status;
}
/* aci_l2cap_cos_reconfiguration_event */
/* Event len: 2 + 1 + 2 + 1 + 2 + 2 + 1 + rp0->CID_Count * (sizeof(uint16_t)) */
/**
 * @brief Event generated when receiving an L2CAP_CREDIT_BASED_RECONFIGURE_REQ
 *        or an L2CAP_CREDIT_BASED_RECONFIGURE_RSP, to reconfigure one or more
 *        (up to 5) L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Event_Type
 *        Values:
 *        - 0x00: L2CAP_ECFC_RECONFIGURE_REQ
 *        - 0x01: L2CAP_ECFC_RECONFIGURE_RESP
 * @param Result Result of the connection request if Event_Type is
 *        L2CAP_ECFC_CONN_RESP. To be ignored if Event_Type is
 *        L2CAP_ECFC_CONN_REQ.
 *        Values:
 *        - 0x0000: L2CAP_RECONFIG_SUCCESSFUL
 *        - 0x0001: L2CAP_RECONFIG_FAIL_MTU_REDUCTION_NOT_ALLOWED
 *        - 0x0002: L2CAP_RECONFIG_FAIL_MPS_REDUCTION_NOT_ALLOWED
 *        - 0x0003: L2CAP_RECONFIG_FAIL_INVALID_CID
 *        - 0x0004: L2CAP_RECONFIG_FAIL_UNACCEPTABLE_PARAMETERS
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel after successful reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel after successful
 *        reconfiguration.
 *        Values:
 *        - 64 ... 65535
 * @param CID_Count Number of Channels that are going to be created.
 *        Values:
 *        - 0x01 ... 0x05
 * @param Local_CID Array of up to 5 two-octet values that represent the local
 *        channel endpoints identifying the EATT channels to be reconfigured.
 * @retval None
 */

tBleStatus aci_l2cap_cos_reconfiguration_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_reconfiguration_event_rp0 *rp0 = (aci_l2cap_cos_reconfiguration_event_rp0 *)buffer_in;
  
