sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  uint16_t Local_CID[HCI_MAX_PAYLOAD_SIZE/sizeof(uint16_t)];
  
  STM32WB_memcpy(Local_CID, rp0->Local_CID, rp0->CID_Count * sizeof(uint16_t));
  
  aci_l2cap_cos_reconfiguration_event(rp0->Connection_Handle,
                                      rp0->Event_Type,
                                      rp0->Result,
                                      rp0->Identifier,
                                      rp0->Peer_MTU,
                                      rp0->Peer_MPS,
                                      rp0->CID_Count,
                                      Local_CID);

  return status;
}
/* aci_l2cap_command_reject_event */
/* Event len: 2 + 1 + 2 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated when the central rejects a L2CAP request.
 * @param Connection_Handle Handle identifying the connection.
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param Reason Reason
 * @param Data_Length Length of following data
 * @param Data Data field associated with Reason
 * @retval None
 */

tBleStatus aci_l2cap_command_reject_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_command_reject_event_rp0 *rp0 = (aci_l2cap_command_reject_event_rp0 *)buffer_in;
  aci_l2cap_command_reject_event(rp0->Connection_Handle,
                                 rp0->Identifier,
                                 rp0->Reason,
                                 rp0->Data_Length,
                                 rp0->Data);

  return status;
}
/* aci_l2cap_cos_connection_req_event */
/* Event len: 2 + 1 + 1 + 2 + 2 + 2 + 2 + 1 */
/**
 * @brief Event generated when a request is received from the peer to create one
 *        L2CAP Credit Based Flow Control channel or one or more (up to 5) L2CAP
 *        Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Identifier This is the identifier which associates the request to the
 *        response.
 * @param SPSM Simplified Protocol/Service Multiplexer
 *        Values:
 *        - 0x0001 ... 0x00FF
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param CID_Count
 * @retval None
 */

tBleStatus aci_l2cap_cos_connection_req_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_connection_req_event_rp0 *rp0 = (aci_l2cap_cos_connection_req_event_rp0 *)buffer_in;
  aci_l2cap_cos_connection_req_event(rp0->Connection_Handle,
                                     rp0->Channel_Type,
                                     rp0->Identifier,
                                     rp0->SPSM,
                                     rp0->Peer_MTU,
                                     rp0->Peer_MPS,
                                     rp0->Initial_Credits,
                                     rp0->CID_Count);

  return status;
}
/* aci_l2cap_cos_connection_resp_event */
/* Event len: 2 + 1 + 2 + 2 + 2 + 2 + 1 + rp0->CID_Count * (sizeof(uint16_t)) */
/**
 * @brief Event generated when a response is received from the peer to create
 *        one L2CAP Credit Based Flow Control channel or one or more (up to 5)
 *        L2CAP Enhanced Credit Based Flow Control channels.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Channel_Type Type of channel: LE Credit Based Flow Control Mode or
 *        Enhanced Credit Based Flow Control Mode.
 *        Values:
 *        - 0x00: L2CAP_CHANNEL_TYPE_LE_CFC
 *        - 0x01: L2CAP_CHANNEL_TYPE_ECFC
 * @param Peer_MTU The maximum SDU size (in octets) that the remote L2CAP layer
 *        entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Peer_MPS The maximum PDU payload size (in octets) that the remote
 *        L2CAP layer entity can receive on this channel.
 *        Values:
 *        - 64 ... 65535
 * @param Initial_Credits The number of K-frames that can be sent to the L2CAP
 *        layer entity of the peer device as soon as the L2CAP channel is
 *        established.
 * @param Result Outcome of the connetion request.
 *        Values:
 *        - 0x0000: L2CAP_CONN_SUCCESSFUL
 *        - 0x0002: L2CAP_CONN_FAIL_SPSM_NOT_SUPPORTED
 *        - 0x0004: L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES
 *        - 0x0005: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHENTICATION
 *        - 0x0006: L2CAP_CONN_FAIL_INSUFFICIENT_AUTHORIZATION
 *        - 0x0007: L2CAP_CONN_FAIL_KEY_SIZE_TOO_SHORT
 *        - 0x0008: L2CAP_CONN_FAIL_INSUFFICIENT_ENCRYPTION
 *        - 0x0009: L2CAP_CONN_FAIL_INVALID_SOURCE_CID
 *        - 0x000A: L2CAP_CONN_FAIL_SOURCE_CID_ALREADY_ALLOCATED
 *        - 0x000B: L2CAP_CONN_FAIL_UNACCEPTABLE_PARAMETERS
 *        - 0x000C: L2CAP_CONN_FAIL_INVALID_PARAMETERS
 *        - 0x000D: L2CAP_CONN_FAIL_NO_INFO
 *        - 0x000E: L2CAP_CONN_FAIL_AUTHENTICATION_PENDING
 *        - 0x000F: L2CAP_CONN_FAIL_AUTHORIZATION_PENDING
 * @param CID_Count Number of channels to be created which are present in the
 *        L2CAP Credit Based Connection Request. The effective number of
 *        channels that will be opened can be less than this value (see
 *        Local_CID) .
 *        Values:
 *        - 0x01 ... 0x05
 * @param CID Array of up to 5 two-octet values that represent the local channel
 *        endpoints.
 * @retval None
 */

tBleStatus aci_l2cap_cos_connection_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cos_connection_resp_event_rp0 *rp0 = (aci_l2cap_cos_connection_resp_event_rp0 *)buffer_in;
  
  uint16_t CID[HCI_MAX_PAYLOAD_SIZE/sizeof(uint16_t)];
  STM32WB_memcpy(CID, rp0->CID, rp0->CID_Count * sizeof(uint16_t));
  
  aci_l2cap_cos_connection_resp_event(rp0->Connection_Handle,
                                      rp0->Channel_Type,
                                      rp0->Peer_MTU,
                                      rp0->Peer_MPS,
                                      rp0->Initial_Credits,
                                      rp0->Result,
                                      rp0->CID_Count,
                                      CID);

