sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* aci_att_clt_read_by_type_resp_event */
/* Event len: 2 + 2 + 1 + 2 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated in response to a ATT_READ_BY_TYPE_REQ, during
 *        a "find included service" procedure or a "discover all
 *        characteristics" procedure. See aci_gatt_clt_find_included_services()
 *        and aci_gatt_clt_disc_all_char_of_service().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Handle_Value_Pair_Length The size of each attribute handle-value pair
 * @param Data_Length Length of Handle_Value_Pair_Data in octets
 * @param Handle_Value_Pair_Data Attribute Data List as defined in Bluetooth
 *        Core v4.1 spec. A sequence of handle-value pairs: [2 octets for
 *        Attribute Handle, (Handle_Value_Pair_Length - 2 octets) for Attribute
 *        Value]
 * @retval None
 */

tBleStatus aci_att_clt_read_by_type_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_by_type_resp_event_rp0 *rp0 = (aci_att_clt_read_by_type_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_by_type_resp_event(rp0->Connection_Handle,
                                      rp0->CID,
                                      rp0->Handle_Value_Pair_Length,
                                      rp0->Data_Length,
                                      rp0->Handle_Value_Pair_Data);

  return status;
}
/* aci_att_clt_read_resp_event */
/* Event len: 2 + 2 + 2 + rp0->Event_Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated in response to a Read Request. See
 *        aci_gatt_clt_read().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Attribute_Value The value of the attribute.
 * @retval None
 */

tBleStatus aci_att_clt_read_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_resp_event_rp0 *rp0 = (aci_att_clt_read_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_resp_event(rp0->Connection_Handle,
                              rp0->CID,
                              rp0->Event_Data_Length,
                              rp0->Attribute_Value);

  return status;
}
/* aci_att_clt_read_blob_resp_event */
/* Event len: 2 + 2 + 2 + rp0->Event_Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event can be generated during a read long characteristic value
 *        procedure. See aci_gatt_clt_read_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Attribute_Value Part of the attribute value.
 * @retval None
 */

tBleStatus aci_att_clt_read_blob_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_blob_resp_event_rp0 *rp0 = (aci_att_clt_read_blob_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_blob_resp_event(rp0->Connection_Handle,
                                   rp0->CID,
                                   rp0->Event_Data_Length,
                                   rp0->Attribute_Value);

  return status;
}
/* aci_att_clt_read_multiple_resp_event */
/* Event len: 2 + 2 + 2 + rp0->Event_Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated in response to a Read Multiple Request. See
 *        aci_gatt_clt_read_multiple_char_value().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Event_Data_Length Length of following data
 * @param Set_Of_Values A set of two or more values. A concatenation of
 *        attribute values for each of the attribute handles in the request in
 *        the order that they were requested.
 * @retval None
 */

tBleStatus aci_att_clt_read_multiple_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_multiple_resp_event_rp0 *rp0 = (aci_att_clt_read_multiple_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_multiple_resp_event(rp0->Connection_Handle,
                                       rp0->CID,
                                       rp0->Event_Data_Length,
                                       rp0->Set_Of_Values);

  return status;
}
/* aci_att_clt_read_by_group_type_resp_event */
/* Event len: 2 + 2 + 1 + 2 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated in response to a Read By Group Type Request,
 *        during a "discover all primary services" procedure. See
 *        aci_gatt_clt_disc_all_primary_services().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Data_Length The size of each attribute data
 * @param Data_Length Length of Attribute_Data_List in octets
 * @param Attribute_Data_List Attribute Data List as defined in Bluetooth Core
 *        v4.1 spec. A sequence of attribute handle, end group handle, attribute
 *        value tuples: [2 octets for Attribute Handle, 2 octets End Group
 *        Handle, (Attribute_Data_Length - 4 octets) for Attribute Value]
 * @retval None
 */

tBleStatus aci_att_clt_read_by_group_type_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_by_group_type_resp_event_rp0 *rp0 = (aci_att_clt_read_by_group_type_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_by_group_type_resp_event(rp0->Connection_Handle,
                                            rp0->CID,
                                            rp0->Attribute_Data_Length,
                                            rp0->Data_Length,
                                            rp0->Attribute_Data_List);

