sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* aci_att_clt_prepare_write_resp_event */
/* Event len: 2 + 2 + 2 + 2 + 2 + rp0->Part_Attribute_Value_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated in response to an ATT_PREPARE_WRITE_REQ during
 *        a write long characteristic value procedure. See
 *        aci_gatt_clt_write_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute to be written
 * @param Offset The offset of the first octet to be written.
 * @param Part_Attribute_Value_Length Length of Part_Attribute_Value in octets
 * @param Part_Attribute_Value The value of the attribute to be written
 * @retval None
 */

tBleStatus aci_att_clt_prepare_write_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_prepare_write_resp_event_rp0 *rp0 = (aci_att_clt_prepare_write_resp_event_rp0 *)buffer_in;
  aci_att_clt_prepare_write_resp_event(rp0->Connection_Handle,
                                       rp0->CID,
                                       rp0->Attribute_Handle,
                                       rp0->Offset,
                                       rp0->Part_Attribute_Value_Length,
                                       rp0->Part_Attribute_Value);

  return status;
}
/* aci_att_clt_exec_write_resp_event */
/* Event len: 2 + 2 */
/**
 * @brief This event is generated in response to an ATT Execute Write Request,
 *        during a write long characteristic value procedure. See
 *        aci_gatt_clt_write_long().
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @retval None
 */

tBleStatus aci_att_clt_exec_write_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_exec_write_resp_event_rp0 *rp0 = (aci_att_clt_exec_write_resp_event_rp0 *)buffer_in;
  aci_att_clt_exec_write_resp_event(rp0->Connection_Handle,
                                    rp0->CID);

  return status;
}
/* aci_gatt_clt_indication_event */
/* Event len: 2 + 2 + 2 + 2 + rp0->Attribute_Value_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated when an indication is received from the
 *        server.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The current value of the attribute
 * @retval None
 */

tBleStatus aci_gatt_clt_indication_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_indication_event_rp0 *rp0 = (aci_gatt_clt_indication_event_rp0 *)buffer_in;
  aci_gatt_clt_indication_event(rp0->Connection_Handle,
                                rp0->CID,
                                rp0->Attribute_Handle,
                                rp0->Attribute_Value_Length,
                                rp0->Attribute_Value);

  return status;
}
/* aci_gatt_clt_notification_event */
/* Event len: 2 + 2 + 2 + 2 + rp0->Attribute_Value_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated when a notification is received from the
 *        server.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The current value of the attribute
 * @retval None
 */

tBleStatus aci_gatt_clt_notification_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_notification_event_rp0 *rp0 = (aci_gatt_clt_notification_event_rp0 *)buffer_in;
  aci_gatt_clt_notification_event(rp0->Connection_Handle,
                                  rp0->CID,
                                  rp0->Attribute_Handle,
                                  rp0->Attribute_Value_Length,
                                  rp0->Attribute_Value);

  return status;
}
/* aci_gatt_clt_proc_complete_event */
/* Event len: 2 + 2 + 1 */
/**
 * @brief This event is generated when a GATT client procedure completes either
 *        with error or successfully.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Error_Code For standard error codes see Bluetooth specification, Vol.
 *        2, part D. For proprietary error code refer to Error codes section.
 * @retval None
 */

tBleStatus aci_gatt_clt_proc_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_proc_complete_event_rp0 *rp0 = (aci_gatt_clt_proc_complete_event_rp0 *)buffer_in;
  aci_gatt_clt_proc_complete_event(rp0->Connection_Handle,
                                   rp0->CID,
                                   rp0->Error_Code);

  return status;
}
/* aci_gatt_clt_error_resp_event */
/* Event len: 2 + 2 + 1 + 2 + 1 */
/**
 * @brief This event is generated when an Error Response is received from the
 *        server. The error response can be given by the server at the end of
 *        one of the GATT discovery procedures. This does not mean that the
 *        procedure ended with an error, but this error event is part of the
 *        procedure itself.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Req_Opcode The request that generated this error response
 * @param Attribute_Handle The attribute handle that generated this error
 *        response
 * @param Error_Code The reason why the request has generated an error response
 *        (ATT error codes)
 *        Values:
 *        - 0x01: Invalid handle
 *        - 0x02: Read not permitted
 *        - 0x03: Write not permitted
 *        - 0x04: Invalid PDU
 *        - 0x05: Insufficient authentication
 *        - 0x06: Request not supported
 *        - 0x07: Invalid offset
 *        - 0x08: Insufficient authorization
 *        - 0x09: Prepare queue full
 *        - 0x0A: Attribute not found
 *        - 0x0B: Attribute not long
 *        - 0x0C: Insufficient encryption key size
 *        - 0x0D: Invalid attribute value length
 *        - 0x0E: Unlikely error
 *        - 0x0F: Insufficient encryption
 *        - 0x10: Unsupported group type
 *        - 0x11: Insufficient resources
 * @retval None
 */

tBleStatus aci_gatt_clt_error_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_error_resp_event_rp0 *rp0 = (aci_gatt_clt_error_resp_event_rp0 *)buffer_in;
  aci_gatt_clt_error_resp_event(rp0->Connection_Handle,
                                rp0->CID,
                                rp0->Req_Opcode,
                                rp0->Attribute_Handle,
                                rp0->Error_Code);

