sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* aci_gatt_clt_disc_read_char_by_uuid_resp_event */
/* Event len: 2 + 2 + 2 + 1 + rp0->Attribute_Value_Length * (sizeof(uint8_t)) */
/**
 * @brief This event can be generated during a "Discover Characteristics By
 *        UUID" procedure or a "Read using Characteristic UUID" procedure.
 *        During a "Discover Characteristics By UUID" procedure, Attribute_Value
 *        is a characteristic declaration as defined in Bluetooth Core spec
 *        (vol.3, Part G, ch. 3.3.1), i.e. it is composed by: Characteristic
 *        Properties (1 octet), Characteristic Value Handle (2 octets) and
 *        Characteristic UUID (2 or 16 octets). During a "Read using
 *        Characteristic UUID" procedure, Attribute_Value is the value of the
 *        characteristic.
 * @param Connection_Handle Connection handle related to the response
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attribute_Handle The handle of the attribute
 * @param Attribute_Value_Length Length of Attribute_Value in octets
 * @param Attribute_Value The attribute value will be a characteristic
 *        declaration as defined in Bluetooth Core spec (vol.3, Part G, ch.
 *        3.3.1), when a "Discover Characteristics By UUID" has been started. It
 *        will be the value of the Characteristic if a "Read using
 *        Characteristic UUID" has been performed.
 * @retval None
 */

tBleStatus aci_gatt_clt_disc_read_char_by_uuid_resp_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *rp0 = (aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *)buffer_in;
  aci_gatt_clt_disc_read_char_by_uuid_resp_event(rp0->Connection_Handle,
                                                 rp0->CID,
                                                 rp0->Attribute_Handle,
                                                 rp0->Attribute_Value_Length,
                                                 rp0->Attribute_Value);

  return status;
}
/* aci_gatt_tx_pool_available_event */
/* Event len: 2 + 2 */
/**
 * @brief Each time Bluetooth stack raises the error code
 *        BLE_STATUS_INSUFFICIENT_RESOURCES, aci_gatt_tx_pool_available_event()
 *        is generated as soon as the available buffer size is greater than
 *        maximum ATT MTU.
 * @param Connection_Handle Connection handle related to the request
 * @param Available_Buffers Not used.
 * @retval None
 */

tBleStatus aci_gatt_tx_pool_available_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_tx_pool_available_event_rp0 *rp0 = (aci_gatt_tx_pool_available_event_rp0 *)buffer_in;
  aci_gatt_tx_pool_available_event(rp0->Connection_Handle,
                                   rp0->Available_Buffers);

  return status;
}
/* aci_gatt_srv_confirmation_event */
/* Event len: 2 + 2 */
/**
 * @brief This event is generated when the client has sent the confirmation to a
 *        previously sent indication.
 * @param Connection_Handle Connection handle related to the event.
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @retval None
 */

tBleStatus aci_gatt_srv_confirmation_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_srv_confirmation_event_rp0 *rp0 = (aci_gatt_srv_confirmation_event_rp0 *)buffer_in;
  aci_gatt_srv_confirmation_event(rp0->Connection_Handle,
                                  rp0->CID);

  return status;
}
/* aci_att_srv_exec_write_req_event */
/* Event len: 2 + 2 + 1 */
/**
 * @brief This event is generated when an execute write request is received from
 *        the peer. This happens when the client wants to write a long attribute
 *        (i.e. an attribute with a size greater than ATT_MTU -3) or more than
 *        one attribute in a single operation. The aci_gatt_srv_resp command
 *        must be sent to give a response to the peer.
 * @param Connection_Handle Handle identifying the connection where the execute
 *        write operation has been received.
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Flags If 1, peer wants to execute all the queued writes. If 0, all
 *        queued writes must be discarded.
 *        Values:
 *        - 0x00: FLUSH
 *        - 0x01: EXECUTE
 * @retval None
 */

tBleStatus aci_att_srv_exec_write_req_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_srv_exec_write_req_event_rp0 *rp0 = (aci_att_srv_exec_write_req_event_rp0 *)buffer_in;
  aci_att_srv_exec_write_req_event(rp0->Connection_Handle,
                                   rp0->CID,
                                   rp0->Flags);

  return status;
}
/* aci_gatt_srv_authorize_nwk_event */
/* Event len: 2 + 2 + 2 + 1 + 2 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief This event is generated if authorization is needed to access the
 *        attribute value. aci_gatt_srv_authorize_resp_nwk command must be sent
 *        in response to this event.
 * @param Conn_Handle Connection handle to be used to identify the connection
 *        with the peer device.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CID If equal to 0x0004, the event is related to an unenhanced ATT
 *        bearer. Otherwise, the value is the local endpoint identifying the
 *        enhanced ATT bearer.
 * @param Attr_Handle
 * @param Operation_Type
 *        Values:
 *        - 0x00: Read
 *        - 0x10: Write Request
 *        - 0x11: Write Command or Signed Write Command
 *        - 0x12: Prepare Write Request
 * @param Attr_Val_Offset Offset from which the value needs to be read or write
 *        Values:
 *        - 0 ... 511
 * @param Data_Length Length of Data field
 * @param Data The data that the client has requested to write
 * @retval None
 */

