sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_directed_advertising_report_event */
/* Event len: 1 + struct_length */
/**
 * @brief The HCI_LE_Directed_Advertising_Report event indicates that directed
 *        advertisements have been received where the advertiser is using a
 *        resolvable private address for the TargetA field of the advertising
 *        PDU which the Controller is unable to resolve and the
 *        Scanning_Filter_Policy is equal to 0x02 or 0x03. Direct_Address_Type
 *        and Direct_Address specify the address the directed advertisements are
 *        being directed to. Address_Type and Address specify the address of the
 *        advertiser sending the directed advertisements. The Controller may
 *        queue these advertising reports and send information from multiple
 *        advertisers in one HCI_LE_Directed_Advertising_Report event. This
 *        event shall only be generated if scanning was enabled using the
 *        HCI_LE_Set_Scan_Enable command. It only reports advertising events
 *        that used legacy advertising PDUs.
 * @param Num_Reports Number of responses in this event.
 *        Values:
 *        - 0x01
 * @param Direct_Advertising_Report See @ref Direct_Advertising_Report_t
 * @retval None
 */

tBleStatus hci_le_directed_advertising_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_directed_advertising_report_event_rp0 *rp0 = (hci_le_directed_advertising_report_event_rp0 *)buffer_in;
  uint8_t size = 1;
  int i;
  Direct_Advertising_Report_t Direct_Advertising_Report[HCI_MAX_PAYLOAD_SIZE/sizeof(Direct_Advertising_Report_t)];
  for (i = 0; i < rp0->Num_Reports; i++) {
    Direct_Advertising_Report[i].Event_Type = rp0->Direct_Advertising_Report[i].Event_Type;
    size += 1;
    Direct_Advertising_Report[i].Address_Type = rp0->Direct_Advertising_Report[i].Address_Type;
    size += 1;
    STM32WB_memcpy((void *) Direct_Advertising_Report[i].Address, (const void *) rp0->Direct_Advertising_Report[i].Address, 6);
    size += 6;
    Direct_Advertising_Report[i].Direct_Address_Type = rp0->Direct_Advertising_Report[i].Direct_Address_Type;
    size += 1;
    STM32WB_memcpy((void *) Direct_Advertising_Report[i].Direct_Address, (const void *) rp0->Direct_Advertising_Report[i].Direct_Address, 6);
    size += 6;
    Direct_Advertising_Report[i].RSSI = rp0->Direct_Advertising_Report[i].RSSI;
    size += 1;
  }
  hci_le_directed_advertising_report_event(rp0->Num_Reports,
                                           Direct_Advertising_Report);

  return status;
}
/* hci_le_phy_update_complete_event */
/* Event len: 1 + 2 + 1 + 1 */
/**
 * @brief The LE PHY Update Complete Event is used to indicate that the
 *        Controller has changed the transmitter PHY or receiver PHY in use. If
 *        the Controller changes the transmitter PHY, the receiver PHY, or both
 *        PHYs, this event shall be issued. If an LE_Set_PHY command was sent
 *        and the Controller determines that neither PHY will change as a
 *        result, it issues this event immediately.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param TX_PHY The transmitter PHY for the connection
 *        Values:
 *        - 0x01: The transmitter PHY for the connection is LE 1M
 *        - 0x02: The transmitter PHY for the connection is LE 2M
 *        - 0x03: The transmitter PHY for the connection is LE Coded
 * @param RX_PHY The receiver PHY for the connection
 *        Values:
 *        - 0x01: The receiver PHY for the connection is LE 1M
 *        - 0x02: The receiver PHY for the connection is LE 2M
 *        - 0x03: The receiver PHY for the connection is LE Coded
 * @retval None
 */

tBleStatus hci_le_phy_update_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_phy_update_complete_event_rp0 *rp0 = (hci_le_phy_update_complete_event_rp0 *)buffer_in;
  hci_le_phy_update_complete_event(rp0->Status,
                                   rp0->Connection_Handle,
                                   rp0->TX_PHY,
                                   rp0->RX_PHY);

  return status;
}
/* hci_le_extended_advertising_report_event */
/* Event len: 1 + struct_length */
/**
 * @brief The LE Extended Advertising Report event indicates that one or more
 *        Bluetooth devices have responded to an active scan or have broadcast
 *        advertisements that were received during a passive scan. The
 *        Controller may coalesce multiple advertising reports from the same or
 *        different advertisers into a single LE Extended Advertising Report
 *        event, provided all the parameters from all the advertising reports
 *        fit in a single HCI event. This event shall only be generated if
 *        scanning was enabled using the LE Set Extended Scan Enable command. It
 *        reports advertising events using either legacy or extended advertising
 *        PDUs. The Controller may split the data from a single advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have an Event_Type with a data status field of
 *        "incomplete, more data to come", while the last shall have the value
 *        "complete"; the Address_Type, Address, Advertising_SID, Primary_PHY,
 *        and Secondary_PHY fields shall be the same in all the reports. When a
 *        scan response is received, bits 0-2 and 4 of the event type shall
 *        indicate the properties of the original advertising event. An
 *        Event_Type with a data status field of "incomplete, data truncated"
 *        indicates that the Controller attempted to receive an AUX_CHAIN_IND
 *        PDU but was not successful.
 * @param Num_Reports Number of separate reports in the event
 *        Values:
 *        - 0x01 ... 0x0A
 * @param Extended_Advertising_Report See @ref Extended_Advertising_Report_t
 * @retval None
 */

tBleStatus hci_le_extended_advertising_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_extended_advertising_report_event_rp0 *rp0 = (hci_le_extended_advertising_report_event_rp0 *)buffer_in;
  uint8_t size = 1;
  int i;
  Extended_Advertising_Report_t Extended_Advertising_Report[HCI_MAX_PAYLOAD_SIZE/sizeof(Extended_Advertising_Report_t)];
  for (i = 0; i < rp0->Num_Reports; i++) {
    Extended_Advertising_Report[i].Event_Type = rp0->Extended_Advertising_Report[i].Event_Type;
    size += 2;
    Extended_Advertising_Report[i].Address_Type = rp0->Extended_Advertising_Report[i].Address_Type;
    size += 1;
    STM32WB_memcpy((void *) Extended_Advertising_Report[i].Address, (const void *) rp0->Extended_Advertising_Report[i].Address, 6);
    size += 6;
    Extended_Advertising_Report[i].Primary_PHY = rp0->Extended_Advertising_Report[i].Primary_PHY;
    size += 1;
    Extended_Advertising_Report[i].Secondary_PHY = rp0->Extended_Advertising_Report[i].Secondary_PHY;
    size += 1;
    Extended_Advertising_Report[i].Advertising_SID = rp0->Extended_Advertising_Report[i].Advertising_SID;
    size += 1;
    Extended_Advertising_Report[i].TX_Power = rp0->Extended_Advertising_Report[i].TX_Power;
    size += 1;
    Extended_Advertising_Report[i].RSSI = rp0->Extended_Advertising_Report[i].RSSI;
    size += 1;
    Extended_Advertising_Report[i].Periodic_Advertising_Interval = rp0->Extended_Advertising_Report[i].Periodic_Advertising_Interval;
    size += 2;
    Extended_Advertising_Report[i].Direct_Address_Type = rp0->Extended_Advertising_Report[i].Direct_Address_Type;
    size += 1;
    STM32WB_memcpy((void *) Extended_Advertising_Report[i].Direct_Address, (const void *) rp0->Extended_Advertising_Report[i].Direct_Address, 6);
    size += 6;
    Extended_Advertising_Report[i].Data_Length = rp0->Extended_Advertising_Report[i].Data_Length;
    size += 1;
    Extended_Advertising_Report[i].Data = rp0->Extended_Advertising_Report[i].Data;
    size += rp0->Extended_Advertising_Report[i].Data_Length;
  }
  hci_le_extended_advertising_report_event(rp0->Num_Reports,
                                           Extended_Advertising_Report);

