sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_established_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 1 + 2 + 1 */
/**
 * @brief The LE Periodic Advertising Report event indicates that the Controller
 *        has received a Periodic Advertising packet. The Sync_Handle parameter
 *        indicates the identifier for the periodic advertisements specified by
 *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
 *        The Controller may split the data from a single periodic advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have a Data_Status of "incomplete, more data to
 *        come", while the last shall have the value "complete". A Data_Status
 *        of "incomplete, data truncated" indicates that the Controller
 *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
 *        Unused parameter shall be set to 0xFF by the Controller and ignored by
 *        the Host.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID Advertising SID subfield in the ADI field of the PDU
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 *        - 0x10 ... 0xFF: Reserved for future use
 * @param Advertiser_Address_Type Advertising Adress Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY Advertiser PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Periodic_Advertising_Interval Periodic Advertising Interval Time = N *
 *        1.25 ms Time Range: 7.5 ms to 81.91875 s
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 *        - 0x08 ... 0xFF: Reserved for future use
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_sync_established_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_established_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_established_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_established_event(rp0->Status,
                                                     rp0->Sync_Handle,
                                                     rp0->Advertising_SID,
                                                     rp0->Advertiser_Address_Type,
                                                     rp0->Advertiser_Address,
                                                     rp0->Advertiser_PHY,
                                                     rp0->Periodic_Advertising_Interval,
                                                     rp0->Advertiser_Clock_Accuracy);

  return status;
}
/* hci_le_periodic_advertising_report_event */
/* Event len: 2 + 1 + 1 + 1 + 1 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief The LE Periodic Advertising Report event indicates that the Controller
 *        has received a Periodic Advertising packet. The Sync_Handle parameter
 *        indicates the identifier for the periodic advertisements specified by
 *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
 *        The Controller may split the data from a single periodic advertisement
 *        (whether one PDU or several) into several reports. If so, each report
 *        except the last shall have a Data_Status of "incomplete, more data to
 *        come", while the last shall have the value "complete". A Data_Status
 *        of "incomplete, data truncated" indicates that the Controller
 *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
 *        Unused parameter shall be set to 0xFF by the Controller and ignored by
 *        the Host.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param TX_Power TX Power. Units: dBm
 *        Values:
 *        - -127 ... 126
 *        - 127: NA
 * @param RSSI RSSI value Units: dBm
 *        Values:
 *        - -127 ... 20: RSSI value
 *        - 127: RSSI is not available
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 *        - 0xFF: No Constant Tone Extension
 * @param Data_Status Data Status
 *        Values:
 *        - 0x00: Data complete
 *        - 0x01: Data incomplete, more data to come
 *        - 0x02: Data incomplete, data truncated, no more to come
 *        - 0x03 ... 0xFF: Reserved for future use
 * @param Data_Length Length of the Data field
 *        Values:
 *        - 0 ... 247: Length of the Data field
 *        - 248 ... 255: Reserved for future use
 * @param Data Data received from a Periodic Advertising packet
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_report_event_rp0 *rp0 = (hci_le_periodic_advertising_report_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_report_event(rp0->Sync_Handle,
                                           rp0->TX_Power,
                                           rp0->RSSI,
                                           rp0->CTE_Type,
                                           rp0->Data_Status,
                                           rp0->Data_Length,
                                           rp0->Data);

