sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_lost_event */
/* Event len: 2 */
/**
 * @brief The LE Periodic Advertising Sync Lost event indicates that the
 *        Controller has not received a Periodic Advertising packet identified
 *        by Sync_Handle within the timeout period.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_sync_lost_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_lost_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_lost_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_lost_event(rp0->Sync_Handle);

  return status;
}
/* hci_le_scan_timeout_event */
/* Event len: 0 */
/**
 * @brief The LE Scan Timeout event indicates that scanning has ended because
 *        the duration has expired. This event shall only be generated if
 *        scanning was enabled using the LE Set Extended Scan Enable command.
 * @retval None
 */

tBleStatus hci_le_scan_timeout_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  hci_le_scan_timeout_event();

  return status;
}
/* hci_le_advertising_set_terminated_event */
/* Event len: 1 + 1 + 2 + 1 */
/**
 * @brief The LE Advertising Set Terminated event indicates that the Controller
 *        has terminated advertising in the advertising sets specified by the
 *        Advertising_Handle parameter. This event shall be generated every time
 *        connectable advertising in an advertising set results in a connection
 *        being created. This event shall only be generated if advertising was
 *        enabled using the LE Set Extended Advertising Enable command. The
 *        Connection_Handle parameter is only valid when advertising ends
 *        because a connection was created. If the
 *        Max_Extended_Advertising_Events parameter in the
 *        LE_Set_Extended_Advertising_Enable command was non-zero, the
 *        Num_Completed_Extended_Advertising_Events parameter shall be set to
 *        the number of completed extended advertising events the Controller had
 *        transmitted when either the duration elapsed or the maximum number of
 *        extended advertising events was reached; otherwise it shall be set to
 *        zero. If advertising has terminated as a result of the advertising
 *        duration elapsing, the Status parameter shall be set to the error code
 *        Advertising Timeout (0x3C). If advertising has terminated because the
 *        Max_Extended_Advertising_Events was reached, the Status parameter
 *        shall be set to the error code Limit Reached (0x43).
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Advertising_Handle Advertising handle in which advertising has ended
 *        Values:
 *        - 0x00 ... 0xEF: Advertising_Handle in which advertising has ended
 *        - 0xF0 ... 0xFF: Reserved for future use
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param Num_Completed_Extended_Advertising_Events Number of completed extended
 *        advertising events transmitted by the Controller
 * @retval None
 */

tBleStatus hci_le_advertising_set_terminated_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_advertising_set_terminated_event_rp0 *rp0 = (hci_le_advertising_set_terminated_event_rp0 *)buffer_in;
  hci_le_advertising_set_terminated_event(rp0->Status,
                                          rp0->Advertising_Handle,
                                          rp0->Connection_Handle,
                                          rp0->Num_Completed_Extended_Advertising_Events);

  return status;
}
/* hci_le_scan_request_received_event */
/* Event len: 1 + 1 + 6 */
/**
 * @brief The LE Scan Request Received event indicates that a SCAN_REQ PDU or an
 *        AUX_SCAN_REQ PDU has been received by the advertiser. The request
 *        contains a device address from a scanner that is allowed by the
 *        advertising filter policy. The advertising set is identified by
 *        Advertising_Handle. This event shall only be generated if advertising
 *        was enabled using the LE Set Extended Advertising Enable command. The
 *        Scanner_Address_Type and Scanner_Address indicates the type of the
 *        address and the address of the scanner device.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 *        - 0xF0 ... 0xFF: Reserved for future use
 * @param Scanner_Address_Type Scanner address  type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private
Address)
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Scanner_Address Public Device Address, Random Device Address, Public
 *        Identity Address or Random (static) Identity Address of the
 *        advertising device
 * @retval None
 */

tBleStatus hci_le_scan_request_received_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_scan_request_received_event_rp0 *rp0 = (hci_le_scan_request_received_event_rp0 *)buffer_in;
  hci_le_scan_request_received_event(rp0->Advertising_Handle,
                                     rp0->Scanner_Address_Type,
                                     rp0->Scanner_Address);

  return status;
}
/* hci_le_channel_selection_algorithm_event */
/* Event len: 2 + 1 */
/**
 * @brief The LE Channel Selection Algorithm Event indicates which channel
 *        selection algorithm is used on a data channel connection (see [Vol 6]
 *        Part B, Section 4.5.8).
 * @param Connection_Handle Connection_Handle to be used to identify a
 *        connection.
 * @param Channel_Selection_Algorithm Channel selection algorithm to be  used on
 *        a data channel connection
 *        Values:
 *        - 0x00: LE Channel Selection Algorithm #1 is used
 *        - 0x01: LE Channel Selection Algorithm #2 is used
 *        - 0x02 ... 0xFF: Reserved for future use
 * @retval None
 */

tBleStatus hci_le_channel_selection_algorithm_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_channel_selection_algorithm_event_rp0 *rp0 = (hci_le_channel_selection_algorithm_event_rp0 *)buffer_in;
  hci_le_channel_selection_algorithm_event(rp0->Connection_Handle,
                                           rp0->Channel_Selection_Algorithm);

