sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_connectionless_iq_report_event */
/* Event len: 2 + 1 + 2 + 1 + 1 + 1 + 1 + 2 + 1 + struct_length */
/**
 * @brief The HCI_LE_Connectionless_IQ_Report event is used by the Controller to
 *        report IQ information from the Constant Tone Extension of a received
 *        advertising packet forming part of the periodic advertising train
 *        identified by Sync_Handle and to report IQ information from the
 *        Constant Tone Extension of a received Test Mode packet (see Section
 *        7.8.28). The index of the channel on which the packet was received,
 *        the RSSI of the packet (excluding the Constant Tone Extension), the ID
 *        of the antenna on which this was measured, the type of Constant Tone
 *        Extension, the value of paEventCounter, and the IQ samples of the
 *        Constant Tone Extension of the advertisement are reported in the
 *        corresponding parameters. For any given sample, either both or neither
 *        of I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations
 *        parameter specifies the sampling rate used by the Controller. The
 *        Packet_Status parameter indicates whether the received packet had a
 *        valid CRC and, if not, whether the Controller has determined the
 *        position and size of the Constant Tone Extension using the Length and
 *        CTETime fields. Note: A Controller is not required to generate this
 *        event for packets that have a bad CRC. The Constant Tone Extension
 *        format is defined in [Vol 6] Part B, Section 2.5.1. If the PDU
 *        contains AdvData, then the HCI_LE_Periodic_Advertising_Report event
 *        shall be generated before this event. The Controller is not required
 *        to generate this event for a Constant Tone Extension with a type that
 *        it does not support. This event is also used by the Controller to
 *        report that it has insufficient resources to report IQ samples for all
 *        received Constant Tone Extensions and has failed to sample at least
 *        once. In this case Packet_Status shall be set to 0xFF and Sample_Count
 *        to 0x00.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 *        - 0x0FFF: TEST_SYNC_HANDLE
 * @param Channel_Index 0x25-0x27 can be used only for packets generated during
 *        test modes.
 *        Values:
 *        - 0x00 ... 0x27: The index of the channel on which the packet was received.
 * @param RSSI RSSI of the packet. Units: 0.1 dBm.
 *        Values:
 *        - -1270 ... 200
 * @param RSSI_Antenna_ID Antenna ID
 * @param CTE_Type Type of Constant Tone Extension.
 *        Values:
 *        - 0x00: AoA_CTE
 *        - 0x01: AoD_CTE_1us
 *        - 0x02: AoD_CTE_2us
 * @param Slot_Durations Sampling rate used by the Controller.
 *        Values:
 *        - 0x01: CTE_SLOT_1us
 *        - 0x02: CTE_SLOT_2us
 * @param Packet_Status It indicates whether the received packet had a valid CRC
 *        and, if not, whether the Controller has determined the position and
 *        size of the Constant Tone Extension using the Length and CTETime
 *        fields. 0x00 - CRC was correct;  0x01 - CRC was incorrect and the
 *        Length and CTETime fields of the packet were used to determine
 *        sampling points;  0x02 - CRC was incorrect but the Controller has
 *        determined the position and length of the Constant Tone Extension in
 *        some other way;  0xFF - Insufficient resources to sample
 *        (Channel_Index, CTE_Type, and Slot_Durations invalid).
 *        Values:
 *        - 0x00: CRC_OK
 *        - 0x01: CRC_ERROR_1
 *        - 0x02: CRC_ERROR_2
 *        - 0xFF: NO_SAMPLES
 * @param Periodic_Event_Counter The value of paEventCounter (see [Vol 6] Part
 *        B, Section 4.4.2.1) for the reported AUX_SYNC_IND PDU
 * @param Sample_Count Total number of sample pairs (there shall be the same
 *        number of I samples and Q samples). Note: This number is dependent on
 *        the switch and sample slot durations used.
 *        Values:
 *        - 0x00
 *        - 0x09 ... 0x52
 * @param Samples See @ref Samples_t
 * @retval None
 */

tBleStatus hci_le_connectionless_iq_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connectionless_iq_report_event_rp0 *rp0 = (hci_le_connectionless_iq_report_event_rp0 *)buffer_in;
  uint8_t size = 12;
  int i;
  Samples_t Samples[HCI_MAX_PAYLOAD_SIZE/sizeof(Samples_t)];
  for (i = 0; i < rp0->Sample_Count; i++) {
    Samples[i].I_Sample = rp0->Samples[i].I_Sample;
    size += 1;
    Samples[i].Q_Sample = rp0->Samples[i].Q_Sample;
    size += 1;
  }
  hci_le_connectionless_iq_report_event(rp0->Sync_Handle,
                                        rp0->Channel_Index,
                                        rp0->RSSI,
                                        rp0->RSSI_Antenna_ID,
                                        rp0->CTE_Type,
                                        rp0->Slot_Durations,
                                        rp0->Packet_Status,
                                        rp0->Periodic_Event_Counter,
                                        rp0->Sample_Count,
                                        Samples);

  return status;
}
/* hci_le_connection_iq_report_event */
/* Event len: 2 + 1 + 1 + 2 + 1 + 1 + 1 + 1 + 2 + 1 + struct_length */
/**
 * @brief The HCI_LE_Connection_IQ_Report event is used by the Controller to
 *        report the IQ samples from the Constant Tone Extension of a received
 *        packet (see [Vol 6] Part B, Section 2.4.2.26). The Connection_Handle
 *        parameter identifies the connection that corresponds to the reported
 *        information. The receiver PHY, the index of the data channel, the RSSI
 *        value of the packet (excluding the Constant Tone Extension), the ID of
 *        the antenna on which this was measured, the type of Constant Tone
 *        Extension, the value of connEventCounter, and the IQ samples of the
 *        Constant Tone Extension of the received packet are reported in the
 *        corresponding parameters. For any given sample, either both or neither
 *        of I_Sample[i] and Q_Sample[i] shall equal 0x80. The Slot_Durations
 *        parameter specifies the sampling rate used by the Controller. The
 *        Packet_Status parameter indicates whether the received packet had a
 *        valid CRC and, if not, whether the Controller has determined the
 *        position and size of the Constant Tone Extension using the Length and
 *        CTETime fields. Note: A Controller is not required to generate this
 *        event for packets that have a bad CRC. This event is also used by the
 *        Controller to report that it has insufficient resources to report IQ
 *        samples for all received Constant Tone Extensions and has failed to
 *        sample at least once. In this case Packet_Status shall be set to 0xFF
 *        and Sample_Count to 0x00. The Constant Tone Extension format is
 *        defined in [Vol 6] Part B, Section 2.1.5.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param RX_PHY
 *        Values:
 *        - 0x01: The receiver PHY for the connection is LE 1M
 *        - 0x02: The receiver PHY for the connection is LE 2M
 * @param Data_Channel_Index
 *        Values:
 *        - 0x00 ... 0x24: The index of the data channel on which the Data Physical Channel PDU was received.
 * @param RSSI RSSI of the packet. Units: 0.1 dBm.
 *        Values:
 *        - -1270 ... 200
 * @param RSSI_Antenna_ID ID of the antenna on which the RSSI is measured
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 * @param Slot_Durations Sampling rate used by the Controller.
 *        Values:
 *        - 0x01: CTE_SLOT_1us
 *        - 0x02: CTE_SLOT_2us
 * @param Packet_Status
 *        Values:
 *        - 0x00: CRC was correct
 *        - 0x01: CRC was incorrect and the Length and CTETime fields of the packet were used to determine sampling points
 *        - 0x02: CRC was incorrect but the Controller has determined the position and length of the Constant Tone Extension in some other way
 *        - 0xFF: Insufficient resources to sample (Channel_Index, CTE_Type, and Slot_Durations invalid).
 * @param Connection_Event_Counter The value of connEventCounter (see [Vol 6]
 *        Part B, Section 4.5.1) for the reported PDU
 * @param Sample_Count Total number of sample pairs.
 *        Values:
 *        - 0x00
 *        - 0x09 ... 0x52
 * @param Samples See @ref Samples_t
 * @retval None
 */

tBleStatus hci_le_connection_iq_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connection_iq_report_event_rp0 *rp0 = (hci_le_connection_iq_report_event_rp0 *)buffer_in;
  uint8_t size = 13;
  int i;
  Samples_t Samples[HCI_MAX_PAYLOAD_SIZE/sizeof(Samples_t)];
  for (i = 0; i < rp0->Sample_Count; i++) {
    Samples[i].I_Sample = rp0->Samples[i].I_Sample;
    size += 1;
    Samples[i].Q_Sample = rp0->Samples[i].Q_Sample;
    size += 1;
  }
  hci_le_connection_iq_report_event(rp0->Connection_Handle,
                                    rp0->RX_PHY,
                                    rp0->Data_Channel_Index,
                                    rp0->RSSI,
                                    rp0->RSSI_Antenna_ID,
                                    rp0->CTE_Type,
                                    rp0->Slot_Durations,
                                    rp0->Packet_Status,
                                    rp0->Connection_Event_Counter,
                                    rp0->Sample_Count,
                                    Samples);

