sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_cte_request_failed_event */
/* Event len: 1 + 2 */
/**
 * @brief This event is used by the Controller to report an issue following a
 *        request to a peer device to reply with a packet containing an
 *        LL_CTE_RSP PDU and a Constant Tone Extension. It shall be generated if
 *        the packet containing the LL_CTE_RSP PDU sent in response did not
 *        contain a Constant Tone Extension or if the peer rejected the request.
 *        It shall not be generated if the packet containing the LL_CTE_RSP PDU
 *        had a CRC error or if the procedure response timeout timer (see [Vol
 *        6] Part B, Section 5.2) expired.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval None
 */

tBleStatus hci_le_cte_request_failed_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_cte_request_failed_event_rp0 *rp0 = (hci_le_cte_request_failed_event_rp0 *)buffer_in;
  hci_le_cte_request_failed_event(rp0->Status,
                                  rp0->Connection_Handle);

  return status;
}
/* hci_le_periodic_advertising_sync_transfer_received_event */
/* Event len: 1 + 2 + 2 + 2 + 1 + 1 + 6 + 1 + 2 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
 *        by the Controller to report that it has received periodic advertising
 *        synchronization information from the device referred to by the
 *        Connection_Handle parameter and either successfully synchronized to
 *        the periodic advertising train or timed out while attempting to
 *        synchronize. The Status will be zero if it successfully synchronized
 *        and non-zero otherwise. The Service_Data value is provided by the Host
 *        of the device sending the information. The Sync_Handle identifies the
 *        periodic advertising in subsequent commands and events and shall be
 *        assigned by the Controller. The remaining parameters provide
 *        information about the periodic advertising (see Section 7.7.65.14). If
 *        Status is non-zero, all parameter values are valid except Sync_Handle,
 *        which the Host shall ignore. Note: If the Controller is already
 *        synchronized to the periodic advertising train described in the
 *        received information, no event will be generated.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_data A value provided by the peer device
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 * @param Advertiser_Address_Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 * @param Periodic_Advertising_Interval Periodic advertising interval. Time = N
 *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_sync_transfer_received_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_transfer_received_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_transfer_received_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_transfer_received_event(rp0->Status,
                                                           rp0->Connection_Handle,
                                                           rp0->Service_data,
                                                           rp0->Sync_Handle,
                                                           rp0->Advertising_SID,
                                                           rp0->Advertiser_Address_Type,
                                                           rp0->Advertiser_Address,
                                                           rp0->Advertiser_PHY,
                                                           rp0->Periodic_Advertising_Interval,
                                                           rp0->Advertiser_Clock_Accuracy);

  return status;
}
/* hci_le_cis_established_event */
/* Event len: 1 + 2 + 3 + 3 + 3 + 3 + 1 + 1 + 1 + 1 + 1 + 1 + 1 + 2 + 2 + 2 */
/**
 * @brief The HCI_LE_CIS_Established event indicates that a CIS has been
 *        established, was considered lost before being established, or (on the
 *        Central) was rejected by the Peripheral. It is generated by the
 *        Controller in the Central and Peripheral. The Connection_Handle
 *        parameter shall be set to the value provided in the HCI_LE_Create_CIS
 *        command on the Central and in the HCI_LE_CIS_Request event on the
 *        Peripheral. The CIG_Sync_Delay parameter is the maximum time, in
 *        microseconds, for transmission of PDUs of all CISes in a CIG event
 *        (see [Vol 6] Part B, Section 4.5.14.1). The CIS_Sync_Delay parameter
 *        is the maximum time, in microseconds, for transmission of PDUs of the
 *        specified CIS in a CIG event (see [Vol 6] Part B, Section 4.5.14.1).
 *        The Transport_Latency_C_To_P and Transport_Latency_P_To_C parameters
 *        are the actual transport latencies, in microseconds, as described in
 *        [Vol 6] Part G, Section 3.2.1 and [Vol 6] Part G, Section 3.2.2. The
 *        PHY_C_To_P parameter indicates the PHY selected for packets from the
 *        Central to Peripheral. The PHY_P_To_C parameter indicates the PHY
 *        selected for packets from the Peripheral to Central. The NSE,
 *        BN_C_To_P, BN_P_To_C, FT_C_To_P, FT_P_To_C, Max_PDU_- C_To_P,
 *        Max_PDU_P_To_C, and ISO_Interval parameters are the corresponding
 *        parameters of the CIS (see [Vol 6] Part B, Section 4.5.13.1). If this
 *        event is generated on the Peripheral with a non-zero status, the
 *        Controller shall delete the Connection_Handle and any associated ISO
 *        data paths.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIG_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of all CISes in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param CIS_Sync_Delay The maximum time, in microseconds, for transmission of
 *        PDUs of the specified CIS in a CIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_C_To_P The actual transport latency, in
 *        microseconds, from Central to Peripheral.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_P_To_C The actual transport latency, in
 *        microseconds, from Peripheral to Central.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param PHY_C_To_P The transmitter PHY of packets from the Central.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param PHY_P_To_C The transmitter PHY of packets from the Peripheral.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param NSE Maximum number of subevents in each isochronous event.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param BN_C_To_P The burst number for Central to Peripheral transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param BN_P_To_C The burst number for Peripheral to Central transmission.
 *        Values:
 *        - 0x00: No data
 *        - 0x01 ... 0x0F
 * @param FT_C_To_P The flush timeout, in multiples of the ISO_Interval for the
 *        CIS, for each payload sent from the Central to the Peripheral.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param FT_P_To_C The flush timeout, in multiples of the ISO_Interval for the
 *        CIS, for each payload sent from the Peripheral to the Central.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param Max_PDU_C_To_P Maximum size, in octets, of the payload from Central to
 *        Peripheral.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param Max_PDU_P_To_C Maximum size, in octets, of the payload from Peripheral
 *        to Central.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive CIS anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @retval None
 */

tBleStatus hci_le_cis_established_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_cis_established_event_rp0 *rp0 = (hci_le_cis_established_event_rp0 *)buffer_in;
  hci_le_cis_established_event(rp0->Status,
                               rp0->Connection_Handle,
                               rp0->CIG_Sync_Delay,
                               rp0->CIS_Sync_Delay,
                               rp0->Transport_Latency_C_To_P,
                               rp0->Transport_Latency_P_To_C,
                               rp0->PHY_C_To_P,
                               rp0->PHY_P_To_C,
                               rp0->NSE,
                               rp0->BN_C_To_P,
                               rp0->BN_P_To_C,
                               rp0->FT_C_To_P,
                               rp0->FT_P_To_C,
                               rp0->Max_PDU_C_To_P,
                               rp0->Max_PDU_P_To_C,
                               rp0->ISO_Interval);

