sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_cis_request_event */
/* Event len: 2 + 2 + 1 + 1 */
/**
 * @brief The HCI_LE_CIS_Request event indicates that a Controller has received
 *        a request to establish a CIS. If the Controller receives such a
 *        request while the HCI_LE_CIS_Request event is masked away, it shall
 *        reject it. Otherwise the Controller shall assign a connection handle
 *        for the requested CIS and send the handle in the CIS_Connection_Handle
 *        parameter of the event. When the Host receives this event it shall
 *        respond with either an HCI_LE_Accept_CIS_Request command or an
 *        HCI_LE_Reject_CIS_Request command before the timer
 *        Connection_Accept_Timeout expires. If it does not, the Controller
 *        shall reject the request and generate an HCI_LE_CIS_Established event
 *        with the status Connection Accept Timeout Exceeded (0x10). The
 *        ACL_Connection_Handle is the connection handle of the ACL connection
 *        that is associated with the requested CIS. The CIG_ID parameter
 *        contains the identifier of the CIG that contains the requested CIS.
 *        This parameter is sent by the Central in the request to establish the
 *        CIS. The CIS_ID parameter contains the identifier of the requested
 *        CIS. This parameter is sent by the Central in the request to establish
 *        the CIS.
 * @param ACL_Connection_Handle Connection handle of the ACL.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIS_Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param CIG_ID Identifier of the CIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param CIS_ID Identifier of the CIS.
 *        Values:
 *        - 0x00 ... 0xEF
 * @retval None
 */

tBleStatus hci_le_cis_request_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_cis_request_event_rp0 *rp0 = (hci_le_cis_request_event_rp0 *)buffer_in;
  hci_le_cis_request_event(rp0->ACL_Connection_Handle,
                           rp0->CIS_Connection_Handle,
                           rp0->CIG_ID,
                           rp0->CIS_ID);

  return status;
}
/* hci_le_create_big_complete_event */
/* Event len: 1 + 1 + 3 + 3 + 1 + 1 + 1 + 1 + 1 + 2 + 2 + 1 + rp0->Num_BIS * (sizeof(uint16_t)) */
/**
 * @brief The HCI_LE_Create_BIG_Complete event indicates that the
 *        HCI_LE_Create_BIG command has completed.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param BIG_Sync_Delay The maximum time in microseconds for transmission of
 *        PDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param Transport_Latency_BIG The maximum delay time, in microseconds, for
 *        transmission of SDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param PHY The PHY used to create the BIG.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param NSE The number of subevents in each BIS event in the BIG.
 *        Values:
 *        - 0x01 ... 0x1E
 * @param BN The number of new payloads in each BIS event.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Offset used for pre-transmissions.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC The number of times a payload is transmitted in a BIS event.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Maximum size, in octets, of the payload.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive BIG anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param Connection_Handle The connection handles of the BISes in the BIG.
 * @retval None
 */

tBleStatus hci_le_create_big_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_create_big_complete_event_rp0 *rp0 = (hci_le_create_big_complete_event_rp0 *)buffer_in;
  
  uint16_t Connection_Handle[HCI_MAX_PAYLOAD_SIZE/sizeof(uint16_t)];
  
  STM32WB_memcpy(Connection_Handle, rp0->Connection_Handle, rp0->Num_BIS * sizeof(uint16_t));
  
  hci_le_create_big_complete_event(rp0->Status,
                                   rp0->BIG_Handle,
                                   rp0->BIG_Sync_Delay,
                                   rp0->Transport_Latency_BIG,
                                   rp0->PHY,
                                   rp0->NSE,
                                   rp0->BN,
                                   rp0->PTO,
                                   rp0->IRC,
                                   rp0->Max_PDU,
                                   rp0->ISO_Interval,
                                   rp0->Num_BIS,
                                   Connection_Handle);

  return status;
}
/* hci_le_terminate_big_complete_event */
/* Event len: 1 + 1 */
/**
 * @brief The HCI_LE_Terminate_BIG_Complete event indicates that the
 *        transmission of all the BISes in the BIG are terminated.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Reason Reason for termination. See Error Codes.
 * @retval None
 */

tBleStatus hci_le_terminate_big_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_terminate_big_complete_event_rp0 *rp0 = (hci_le_terminate_big_complete_event_rp0 *)buffer_in;
  hci_le_terminate_big_complete_event(rp0->BIG_Handle,
                                      rp0->Reason);

  return status;
}
/* hci_le_big_sync_established_event */
/* Event len: 1 + 1 + 3 + 1 + 1 + 1 + 1 + 2 + 2 + 1 + rp0->Num_BIS * (sizeof(uint16_t)) */
/**
 * @brief The HCI_LE_BIG_Sync_Established event indicates that the
 *        HCI_LE_BIG_Create_Sync command has completed.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Transport_Latency_BIG The maximum delay time, in microseconds, for
 *        transmission of SDUs of all BISes in a BIG event.
 *        Values:
 *        - 0x0000EA ... 0x7FFFFF
 * @param NSE The number of subevents in each BIS event in the BIG.
 *        Values:
 *        - 0x01 ... 0x1E
 * @param BN The number of new payloads in each BIS event.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Offset used for pre-transmissions.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC The number of times a payload is transmitted in a BIS event.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Maximum size, in octets, of the payload.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param ISO_Interval The time between two consecutive BIG anchor points. Time
 *        = N * 1.25 ms.
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param Connection_Handle The connection handles of the BISes in the BIG.
 * @retval None
 */

tBleStatus hci_le_big_sync_established_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_big_sync_established_event_rp0 *rp0 = (hci_le_big_sync_established_event_rp0 *)buffer_in;
  
  uint16_t Connection_Handle[HCI_MAX_PAYLOAD_SIZE/sizeof(uint16_t)];
  
  STM32WB_memcpy(Connection_Handle, rp0->Connection_Handle, rp0->Num_BIS * sizeof(uint16_t));
  
  hci_le_big_sync_established_event(rp0->Status,
                                    rp0->BIG_Handle,
                                    rp0->Transport_Latency_BIG,
                                    rp0->NSE,
                                    rp0->BN,
                                    rp0->PTO,
                                    rp0->IRC,
                                    rp0->Max_PDU,
                                    rp0->ISO_Interval,
                                    rp0->Num_BIS,
                                    Connection_Handle);

