sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_big_sync_lost_event */
/* Event len: 1 + 1 */
/**
 * @brief The HCI_LE_BIG_Sync_Lost event indicates that the Controller has not
 *        received any PDUs on a BIG within the timeout period BIG_Sync_Timeout
 *        or the BIG has been terminated by the remote device.
 * @param BIG_Handle The identifier of the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Reason Reason for termination. See Error Codes.
 * @retval None
 */

tBleStatus hci_le_big_sync_lost_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_big_sync_lost_event_rp0 *rp0 = (hci_le_big_sync_lost_event_rp0 *)buffer_in;
  hci_le_big_sync_lost_event(rp0->BIG_Handle,
                             rp0->Reason);

  return status;
}
/* hci_le_request_peer_sca_complete_event */
/* Event len: 1 + 2 + 1 */
/**
 * @brief The HCI_LE_Request_Peer_SCA_Complete event indicates that the
 *        HCI_LE_Request_Peer_SCA command has been completed. The
 *        Peer_Clock_Accuracy parameter contains the sleep clock accuracy of the
 *        peer. The Connection_Handle is the connection handle of the ACL
 *        connection in which the HCI_LE_Request_Peer_SCA command is issued.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle of the ACL.
 * @param Peer_Clock_Accuracy Sleep clock accuracy of the peer.
 *        Values:
 *        - 0x00: 251 ppm to 500 ppm
 *        - 0x01: 151 ppm to 250 ppm
 *        - 0x02: 101 ppm to 150 ppm
 *        - 0x03: 76 ppm to 100 ppm
 *        - 0x04: 51 ppm to 75 ppm
 *        - 0x05: 31 ppm to 50 ppm
 *        - 0x06: 21 ppm to 30 ppm
 *        - 0x07: 0 ppm to 20 ppm
 * @retval None
 */

tBleStatus hci_le_request_peer_sca_complete_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_request_peer_sca_complete_event_rp0 *rp0 = (hci_le_request_peer_sca_complete_event_rp0 *)buffer_in;
  hci_le_request_peer_sca_complete_event(rp0->Status,
                                         rp0->Connection_Handle,
                                         rp0->Peer_Clock_Accuracy);

  return status;
}
/* hci_le_path_loss_threshold_event */
/* Event len: 2 + 1 + 1 */
/**
 * @brief Report a path loss threshold crossing on the ACL connection identified
 *        by the Connection_Handle parameter.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Current_Path_Loss Current path loss (always zero or positive). Units:
 *        dB.
 *        Values:
 *        - 0 ... 254
 *        - 255: NA
 * @param Zone_Entered The Zone_Entered parameter indicates which zone was
 *        entered.
 *        Values:
 *        - 0x00: LOW_ZONE
 *        - 0x01: MIDDLE_ZONE
 *        - 0x02: HIGH_ZONE
 * @retval None
 */

tBleStatus hci_le_path_loss_threshold_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_path_loss_threshold_event_rp0 *rp0 = (hci_le_path_loss_threshold_event_rp0 *)buffer_in;
  hci_le_path_loss_threshold_event(rp0->Connection_Handle,
                                   rp0->Current_Path_Loss,
                                   rp0->Zone_Entered);

  return status;
}
/* hci_le_transmit_power_reporting_event */
/* Event len: 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
 * @brief Report the transmit power level on the ACL connection identified by
 *        the Connection_Handle parameter.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Reason The reason why the event was sent and the device whose transmit
 *        power level is being reported. - 0x00: Local transmit power changed -
 *        0x01: Remote transmit power changed - 0x02:
 *        HCI_LE_Read_Remote_Transmit_Power_Level command completed
 *        Values:
 *        - 0x00: LOCAL_TX_POWER_CHANGE
 *        - 0x01: REMOTE_TX_POWER_CHANGE
 *        - 0x02: READ_REMOTE_TX_POWER_COMPLETE
 * @param PHY PHY associated with the connection  (not necessarily the currently
 *        used one).
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @param Transmit_Power_Level The transmit power level for the PHY (dBm).
 *        Values:
 *        - -127 ... 20
 *        - 126: POWER_NOT_MANAGED
 *        - 127: POWER_NA
 * @param Transmit_Power_Level_Flag It indicates whether the transmit power
 *        level that is being reported has reached its minimum and/or maximum
 *        level. Transmit_Power_Level_Flag shall be ignored if the
 *        Transmit_Power_Level parameter is set to 0x7E or 0x7F.
 *        Flags:
 *        - 0x01: MIN_TX_POWER_BIT
 *        - 0x02: MAX_TX_POWER_BIT
 * @param Delta The Delta parameter is set to the change in power level for the
 *        transmitter being reported, whenever it changes its transmit power
 *        level. Delta shall be ignored if the Transmit_Power_Level parameter is
 *        set to 0x7E.
 *        Values:
 *        - 0 ... 126
 *        - 127: NA
 * @retval None
 */

tBleStatus hci_le_transmit_power_reporting_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_transmit_power_reporting_event_rp0 *rp0 = (hci_le_transmit_power_reporting_event_rp0 *)buffer_in;
  hci_le_transmit_power_reporting_event(rp0->Status,
                                        rp0->Connection_Handle,
                                        rp0->Reason,
                                        rp0->PHY,
                                        rp0->Transmit_Power_Level,
                                        rp0->Transmit_Power_Level_Flag,
                                        rp0->Delta);

