sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_biginfo_advertising_report_event */
/* Event len: 2 + 1 + 1 + 2 + 1 + 1 + 1 + 2 + 3 + 2 + 1 + 1 + 1 */
/**
 * @brief The HCI_LE_BIGInfo_Advertising_Report event indicates that the
 *        Controller has received an Advertising PDU that contained a BIGInfo
 *        field. If the Controller also generates an
 *        HCI_LE_Periodic_Advertising_Report event, the
 *        HCI_LE_BIGInfo_Advertising_Report event shall immediately follow that
 *        event. An HCI_LE_BIGInfo_Advertising_Report event shall be generated
 *        even if the Controller is already synchronized to the BIG. The
 *        Sync_Handle parameter shall identify the periodic advertising train
 *        containing the BIGInfo field and shall be the same as the
 *        corresponding field in the HCI_LE_Periodic_Advertising_Report event if
 *        one is generated. The Num_BIS, NSE, ISO_Interval, BN, PTO, IRC,
 *        Max_PDU, SDU_Interval, Max_SDU, PHY, and Framing parameters correspond
 *        to the associated fields in the BIGInfo field of the Advertising PDU.
 *        If the BIGInfo field indicates that the corresponding BIG is
 *        encrypted, the Encryption parameter shall be set to 0x01. Otherwise,
 *        the Encryption parameter shall be set to 0x00.
 * @param Sync_Handle Sync_Handle identifying the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Num_BIS Value of the Num_BIS subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param NSE Value of the NSE subfield of the BIGInfo field.
 * @param ISO_Interval Value of the ISO_Interval subfield of the BIGInfo field.
 * @param BN Value of the BN subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x07
 * @param PTO Value of the PTO subfield of the BIGInfo field.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param IRC Value of the IRC subfield of the BIGInfo field.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Max_PDU Value of the Max_PDU subfield of the BIGInfo.
 *        Values:
 *        - 0x0000 ... 0x00FB
 * @param SDU_Interval Value of the SDU_Interval subfield of the BIGInfo field.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param Max_SDU Value of the Max_SDU subfield of the BIGInfo field in the
 *        Advertising PDU.
 *        Values:
 *        - 0x0001 ... 0x0FFF
 * @param PHY The PHY on which the BIG is transmitted.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Framing If BIG carries encrypted (1) or unencrypted (0) data.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @param Encryption If BIG carries encrypted (1) or unencrypted (0) data.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @retval None
 */

tBleStatus hci_le_biginfo_advertising_report_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_biginfo_advertising_report_event_rp0 *rp0 = (hci_le_biginfo_advertising_report_event_rp0 *)buffer_in;
  hci_le_biginfo_advertising_report_event(rp0->Sync_Handle,
                                          rp0->Num_BIS,
                                          rp0->NSE,
                                          rp0->ISO_Interval,
                                          rp0->BN,
                                          rp0->PTO,
                                          rp0->IRC,
                                          rp0->Max_PDU,
                                          rp0->SDU_Interval,
                                          rp0->Max_SDU,
                                          rp0->PHY,
                                          rp0->Framing,
                                          rp0->Encryption);

  return status;
}
/* hci_le_subrate_change_event */
/* Event len: 1 + 2 + 2 + 2 + 2 + 2 */
/**
 * @brief The HCI_LE_Subrate_Change event is used to indicate that a Connection
 *        Subrate Update procedure has completed and some parameters of the
 *        specified connection have changed. This event shall be issued if the
 *        HCI_LE_Subrate_Request command was issued by the Host or the
 *        parameters are updated successfully following a request from the peer
 *        device. If no parameters are updated following a request from the peer
 *        device or the parameters were changed using the Connection Update
 *        procedure, then this event shall not be issued.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Handle identifing the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Subrate_Factor New subrate factor applied to the specified underlying
 *        connection interval.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Peripheral_Latency New Peripheral latency for the connection in number
 *        of subrated connection events,
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Continuation_Number Number of underlying connection events to remain
 *        active after a packet containing a Link Layer PDU with a non-zero
 *        Length field is sent or received.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout New supervision timeout for this connection. Time
 *        = N x 10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @retval None
 */

tBleStatus hci_le_subrate_change_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_subrate_change_event_rp0 *rp0 = (hci_le_subrate_change_event_rp0 *)buffer_in;
  hci_le_subrate_change_event(rp0->Status,
                              rp0->Connection_Handle,
                              rp0->Subrate_Factor,
                              rp0->Peripheral_Latency,
                              rp0->Continuation_Number,
                              rp0->Supervision_Timeout);

