sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_established_v2_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Established event indicates that
 *        the Controller has received the first periodic advertising packet from
 *        an advertiser after the HCI_LE_Periodic_Advertising_Create_Sync
 *        command has been sent to the Controller. The Sync_Handle parameter
 *        identifies the periodic advertising train in subsequent commands and
 *        events and shall be assigned by the Controller. The Advertising_SID
 *        parameter is set to the value of the Advertising SID subfield in the
 *        ADI field of the advertising PDU referring to the periodic advertising
 *        train. The Advertiser_Address_Type and Advertiser_Address parameters
 *        specify the address of the periodic advertiser. The Advertiser_PHY
 *        parameter specifies the PHY used for the periodic advertising. The
 *        Periodic_Advertising_Interval parameter specifies the interval between
 *        the periodic advertising events. The Advertiser_Clock_Accuracy
 *        parameter specifies the accuracy of the periodic advertiser's clock.
 *        If the periodic advertising has subevents or response slots, then the
 *        Num_- Subevents, Subevent_Interval, Response_Slot_Delay, and
 *        Response_Slot_- Spacing specify the parameters for these subevents,
 *        otherwise these values shall be set to 0x00.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID Advertising SID subfield in the ADI field of the PDU
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
 *        - 0x10 ... 0xFF: Reserved for future use
 * @param Advertiser_Address_Type Advertising Adress Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved PrivateAddress)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY Advertiser PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 *        - 0x04 ... 0xFF: Reserved for future use
 * @param Periodic_Advertising_Interval Periodic Advertising Interval Time = N *
 *        1.25 ms Time Range: 7.5 ms to 81.91875 s
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 50 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 *        - 0x08 ... 0xFF: Reserved for future use
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Subevent interval. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No subevents
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Response slot delay. Range: 0x01 to 0xFE. Time = N
 *        x 1.25 ms
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Response slot spacing Range: 0x02 to 0xFF Time =
 *        N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_sync_established_v2_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_established_v2_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_established_v2_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_established_v2_event(rp0->Status,
                                                        rp0->Sync_Handle,
                                                        rp0->Advertising_SID,
                                                        rp0->Advertiser_Address_Type,
                                                        rp0->Advertiser_Address,
                                                        rp0->Advertiser_PHY,
                                                        rp0->Periodic_Advertising_Interval,
                                                        rp0->Advertiser_Clock_Accuracy,
                                                        rp0->Num_Subevents,
                                                        rp0->Subevent_Interval,
                                                        rp0->Response_Slot_Delay,
                                                        rp0->Response_Slot_Spacing);

  return status;
}
/* hci_le_periodic_advertising_report_v2_event */
/* Event len: 2 + 1 + 1 + 1 + 2 + 1 + 1 + 1 + rp0->Data_Length * (sizeof(uint8_t)) */
/**
 * @brief The HCI_LE_Periodic_Advertising_Report event indicates that the
 *        Controller has received a periodic advertisement or has failed to
 *        receive an AUX_SYNC_SUBEVENT_IND PDU. The Sync_Handle parameter
 *        identifies the periodic advertising train that the report relates to.
 *        The RSSI parameter contains the RSSI value, excluding any Constant
 *        Tone Extension. If the Controller supports the Connectionless CTE
 *        Receiver feature, RSSI shall not be set to 0x7F. When multiple
 *        advertising packets are used to complete a periodic advertising report
 *        (e.g., a packet containing an AUX_SYNC_IND PDU combined with one
 *        containing an AUX_CHAIN PDU), the RSSI event parameter shall be set
 *        based on the last packet received and the TX_Power event parameter
 *        shall be set based on the AUX_SYNC_IND PDU. However, the second or
 *        subsequent events for the same periodic advertisement may instead have
 *        a TX_Power value of 0x7F. The Controller may split the data from a
 *        single periodic advertisement (whether one PDU or several) into
 *        several reports. If so, each report except the last shall have a
 *        Data_Status of "incomplete, more data to come", while the last shall
 *        have the value "complete". No further reports shall be sent for a
 *        given periodic advertisement after one with a Data_Status other than
 *        "incomplete, more data to come". A Data_Status of "incomplete, data
 *        truncated" indicates that the Controller attempted to receive an
 *        AUX_CHAIN_IND PDU but was not successful or received it but was unable
 *        to store the data. The CTE_Type parameter indicates the type of
 *        Constant Tone Extension in the periodic advertising packets. The
 *        Periodic_Event_Counter parameter indicates the periodic advertising
 *        event counter (paEventCounter) of the event that the periodic
 *        advertising packet was received in. The Subevent parameter indicates
 *        the Periodic Advertising with Responses subevent that the periodic
 *        advertising packet was received in. If the Periodic Advertising does
 *        not have subevents, then Subevent shall be set to 0xFF. If the
 *        Controller receives an AUX_CHAIN_IND PDU with no AdvData, it should
 *        send the report (or the last report if it has split the data)
 *        immediately without waiting for any subsequent AUX_CHAIN_IND PDUs.
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param TX_Power TX Power. Units: dBm
 *        Values:
 *        - -127 ... 126
 *        - 127: NA
 * @param RSSI RSSI value Units: dBm
 *        Values:
 *        - -127 ... 20: RSSI value
 *        - 127: RSSI is not available
 * @param CTE_Type
 *        Values:
 *        - 0x00: AoA Constant Tone Extension
 *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
 *        - 0xFF: No Constant Tone Extension
 * @param Periodic_Event_Counter The value of paEventCounter (see [Vol 6] Part
 *        B, Section 4.4.2.1) for the reported periodic advertising packet.
 * @param Subevent The subevent number.
 *        Values:
 *        - 0x00 ... 0x7F
 *        - 0xFF: No subevents
 * @param Data_Status Data Status
 *        Values:
 *        - 0x00: Data complete
 *        - 0x01: Data incomplete, more data to come
 *        - 0x02: Data incomplete, data truncated, no more to come
 *        - 0xFF: Failed to receive an AUX_SYNC_SUBEVENT_IND PDU
 * @param Data_Length Length of the Data field
 *        Values:
 *        - 0 ... 247: Length of the Data field
 *        - 248 ... 255: Reserved for future use
 * @param Data Data received from a Periodic Advertising packet
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_report_v2_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_report_v2_event_rp0 *rp0 = (hci_le_periodic_advertising_report_v2_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_report_v2_event(rp0->Sync_Handle,
                                              rp0->TX_Power,
                                              rp0->RSSI,
                                              rp0->CTE_Type,
                                              rp0->Periodic_Event_Counter,
                                              rp0->Subevent,
                                              rp0->Data_Status,
                                              rp0->Data_Length,
                                              rp0->Data);

