sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_transfer_received_v2_event */
/* Event len: 1 + 2 + 2 + 2 + 1 + 1 + 6 + 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
 *        by the Controller to report that it has received periodic advertising
 *        synchronization information from the device referred to by the
 *        Connection_Handle parameter and either successfully synchronized to
 *        the periodic advertising train or timed out while attempting to
 *        synchronize. The Status will be zero if it successfully synchronized
 *        and non-zero otherwise. The Service_Data value is provided by the Host
 *        of the device sending the information. The Sync_Handle identifies the
 *        periodic advertising in subsequent commands and events and shall be
 *        assigned by the Controller. The remaining parameters provide
 *        information about the periodic advertising (see Section 7.7.65.14). If
 *        there are no subevents or response slots, then the Controller shall
 *        set the Num_Subevents parameter to zero and the Host shall ignore the
 *        Subevent_Interval, Response_Slot_Delay, and Response_Slot_- Spacing
 *        parameters. If Status is non-zero, all parameter values are valid
 *        except Sync_Handle, which the Host shall ignore. Note: If the
 *        Controller is already synchronized to the periodic advertising train
 *        described in the received information, no event will be generated.
 * @param Status For standard error codes see Bluetooth specification, Vol. 2,
 *        part D. For proprietary error code refer to Error codes section.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_data A value provided by the peer device
 * @param Sync_Handle Sync handle that identifies the synchronization
 *        information about the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Advertising_SID
 *        Values:
 *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
 * @param Advertiser_Address_Type
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
 *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
 * @param Advertiser_Address Public Device Address, Random Device Address,
 *        Public Identity Address, or Random (static) Identity Address of the
 *        advertiser
 * @param Advertiser_PHY
 *        Values:
 *        - 0x01: Advertiser PHY is LE 1M
 *        - 0x02: Advertiser PHY is LE 2M
 *        - 0x03: Advertiser PHY is LE Coded
 * @param Periodic_Advertising_Interval Periodic advertising interval. Time = N
 *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Advertiser_Clock_Accuracy Advertiser Clock Accuracy
 *        Values:
 *        - 0x00: 500 ppm
 *        - 0x01: 250 ppm
 *        - 0x02: 150 ppm
 *        - 0x03: 100 ppm
 *        - 0x04: 75 ppm
 *        - 0x05: 60 ppm
 *        - 0x06: 30 ppm
 *        - 0x07: 20 ppm
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Subevent interval. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No subevents
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Response slot delay. Range: 0x01 to 0xFE. Time = N
 *        x 1.25 ms
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Response slot spacing Range: 0x02 to 0xFF Time =
 *        N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_sync_transfer_received_v2_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_transfer_received_v2_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_transfer_received_v2_event(rp0->Status,
                                                              rp0->Connection_Handle,
                                                              rp0->Service_data,
                                                              rp0->Sync_Handle,
                                                              rp0->Advertising_SID,
                                                              rp0->Advertiser_Address_Type,
                                                              rp0->Advertiser_Address,
                                                              rp0->Advertiser_PHY,
                                                              rp0->Periodic_Advertising_Interval,
                                                              rp0->Advertiser_Clock_Accuracy,
                                                              rp0->Num_Subevents,
                                                              rp0->Subevent_Interval,
                                                              rp0->Response_Slot_Delay,
                                                              rp0->Response_Slot_Spacing);

  return status;
}
/* hci_le_periodic_advertising_subevent_data_request_event */
/* Event len: 1 + 1 + 1 */
/**
 * @brief The HCI_LE_Periodic_Advertising_Subevent_Data_Request event is used to
 *        allow the Controller to indicate that it is ready to transmit one or
 *        more subevents and is requesting the advertising data for these
 *        subevents. The Subevent_Data_Count parameter shall be less than or
 *        equal to the number of subevents. The Subevent_Start parameter is the
 *        first subevent being requested and the Subevent_Data_Count parameter
 *        determines the subsequent subevents being requested. The subevent
 *        numbers wrap from one less than the number of subevents to zero. This
 *        event should be sent from the Controller when it has no data for
 *        upcoming subevents. The Controller should request data for as many
 *        subevents as it has memory to accept to minimize the number of events
 *        generated by the Controller.
 * @param Advertising_Handle Used to identify a periodic advertising train.
 * @param Subevent_Start The first subevent that data is requested for.
 *        Values:
 *        - 0x00 ... 0x7F
 * @param Subevent_Data_Count The number of subevents that data is requested
 *        for.
 *        Values:
 *        - 0x01 ... 0x80
 * @retval None
 */

tBleStatus hci_le_periodic_advertising_subevent_data_request_event_process(uint8_t *buffer_in)
{
  tBleStatus status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_subevent_data_request_event_rp0 *rp0 = (hci_le_periodic_advertising_subevent_data_request_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_subevent_data_request_event(rp0->Advertising_Handle,
                                                          rp0->Subevent_Start,
                                                          rp0->Subevent_Data_Count);

